import proofs.StoredRedCells.S7Data.Definitions
namespace StoredRedCells.S7Certificate.Part9
set_option maxRecDepth 4096
def chunk144 : List Column := [
  -- R_ENZFM_enzyme_ACAC_ACtex_fwd_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (4954, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ACAC_ACtex_fwd_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (4954, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ACAC_ACtex_fwd_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (4954, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ACAC_ACtex_fwd_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (4954, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_ACAC_ACtex_fwd_pc
  ⟨[(4954, (-10000000000000000 : ℤ)), (4955, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_ACAC_ACtex_total_pc
  ⟨[(4955, (-10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ACAC_ACtex_rev_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (4956, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ACAC_ACtex_rev_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (4956, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ACAC_ACtex_rev_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (4956, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ACAC_ACtex_rev_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (4956, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ACAC_ACtex_rev_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (4956, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_ACAC_ACtex_rev_pc
  ⟨[(4956, (-10000000000000000 : ℤ)), (4955, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ACAC_GLYCLTtex_fwd_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (4957, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ACAC_GLYCLTtex_fwd_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (4957, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ACAC_GLYCLTtex_fwd_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (4957, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ACAC_GLYCLTtex_fwd_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (4957, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ACAC_GLYCLTtex_fwd_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (4957, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_ACAC_GLYCLTtex_fwd_pc
  ⟨[(4957, (-10000000000000000 : ℤ)), (4958, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_ACAC_GLYCLTtex_total_pc
  ⟨[(4958, (-10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ACAC_GLYCLTtex_rev_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (4959, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ACAC_GLYCLTtex_rev_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (4959, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ACAC_GLYCLTtex_rev_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (4959, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ACAC_GLYCLTtex_rev_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (4959, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ACAC_GLYCLTtex_rev_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (4959, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ACAC_GLYCLTtex_rev_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (4959, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ACACt2_fwd_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (4960, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ACACt2_fwd_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (4960, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ACACt2_fwd_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (4960, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ACACt2_fwd_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (4960, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ACACt2_fwd_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (4960, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ACACt2_fwd_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (4960, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_ACACt2_fwd_pc
  ⟨[(4960, (-10000000000000000 : ℤ)), (4961, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_ACACt2_total_pc
  ⟨[(4961, (-10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ACACt2_rev_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (4962, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ACACt2_rev_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (4962, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ACACt2_rev_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (4962, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ACACt2_rev_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (4962, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ACACt2_rev_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (4962, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_ACACt2_rev_pc
  ⟨[(4962, (-10000000000000000 : ℤ)), (4961, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_AC_GLYCLTtex_fwd_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (4963, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_AC_GLYCLTtex_fwd_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (4963, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_AC_GLYCLTtex_fwd_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (4963, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_AC_GLYCLTtex_fwd_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (4963, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_AC_GLYCLTtex_fwd_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (4963, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_AC_GLYCLTtex_fwd_pc
  ⟨[(4963, (-10000000000000000 : ℤ)), (4964, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_AC_GLYCLTtex_total_pc
  ⟨[(4964, (-10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_AC_GLYCLTtex_rev_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (4965, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_AC_GLYCLTtex_rev_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (4965, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_AC_GLYCLTtex_rev_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (4965, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_AC_GLYCLTtex_rev_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (4965, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_AC_GLYCLTtex_rev_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (4965, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_AC_GLYCLTtex_rev_pc
  ⟨[(4965, (-10000000000000000 : ℤ)), (4964, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ACt2_fwd_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (4966, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ACt2_fwd_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (4966, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ACt2_fwd_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (4966, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ACt2_fwd_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (4966, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ACt2_fwd_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (4966, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ACt2_fwd_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (4966, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_ACt2_fwd_pc
  ⟨[(4966, (-10000000000000000 : ℤ)), (4967, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_ACt2_total_pc
  ⟨[(4967, (-10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ACt2_rev_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (4968, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ACt2_rev_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (4968, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ACt2_rev_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (4968, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ACt2_rev_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (4968, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩
]
theorem chunk144_cost : (chunk144.map cost).sum = (0 : ℤ) := by
  decide +kernel
def chunk145 : List Column := [
  -- R_ENZFM_enzyme_ACt2_rev_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (4968, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_ACt2_rev_pc
  ⟨[(4968, (-10000000000000000 : ℤ)), (4967, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUT_ACACtex_fwd_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (4969, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUT_ACACtex_fwd_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (4969, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUT_ACACtex_fwd_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (4969, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUT_ACACtex_fwd_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (4969, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUT_ACACtex_fwd_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (4969, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_BUT_ACACtex_fwd_pc
  ⟨[(4969, (-10000000000000000 : ℤ)), (4970, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_BUT_ACACtex_total_pc
  ⟨[(4970, (-10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUT_ACACtex_rev_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (4971, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUT_ACACtex_rev_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (4971, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUT_ACACtex_rev_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (4971, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUT_ACACtex_rev_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (4971, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUT_ACACtex_rev_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (4971, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_BUT_ACACtex_rev_pc
  ⟨[(4971, (-10000000000000000 : ℤ)), (4970, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUT_ACtex_fwd_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (4972, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUT_ACtex_fwd_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (4972, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUT_ACtex_fwd_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (4972, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUT_ACtex_fwd_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (4972, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUT_ACtex_fwd_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (4972, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUT_ACtex_fwd_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (4972, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_BUT_ACtex_fwd_pc
  ⟨[(4972, (-10000000000000000 : ℤ)), (4973, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUT_ACtex_rev_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (4974, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUT_ACtex_rev_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (4974, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUT_ACtex_rev_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (4974, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUT_ACtex_rev_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (4974, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUT_ACtex_rev_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (4974, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUT_ACtex_rev_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (4974, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_BUT_ACtex_rev_pc
  ⟨[(4974, (-10000000000000000 : ℤ)), (4973, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUT_GLYCLTtex_fwd_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (4975, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUT_GLYCLTtex_fwd_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (4975, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUT_GLYCLTtex_fwd_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (4975, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUT_GLYCLTtex_fwd_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (4975, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUT_GLYCLTtex_fwd_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (4975, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_BUT_GLYCLTtex_fwd_pc
  ⟨[(4975, (-10000000000000000 : ℤ)), (4976, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_BUT_GLYCLTtex_total_pc
  ⟨[(4976, (-10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUT_GLYCLTtex_rev_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (4977, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUT_GLYCLTtex_rev_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (4977, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUT_GLYCLTtex_rev_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (4977, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUT_GLYCLTtex_rev_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (4977, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUT_GLYCLTtex_rev_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (4977, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_BUT_GLYCLTtex_rev_pc
  ⟨[(4977, (-10000000000000000 : ℤ)), (4976, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUT_PPAtex_fwd_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (4978, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUT_PPAtex_fwd_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (4978, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUT_PPAtex_fwd_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (4978, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUT_PPAtex_fwd_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (4978, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUT_PPAtex_fwd_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (4978, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUT_PPAtex_fwd_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (4978, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_BUT_PPAtex_total_pc
  ⟨[(4979, (-10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUT_PPAtex_rev_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (4980, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUT_PPAtex_rev_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (4980, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUT_PPAtex_rev_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (4980, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUT_PPAtex_rev_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (4980, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUT_PPAtex_rev_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (4980, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUT_PPAtex_rev_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (4980, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_BUT_PPAtex_rev_pc
  ⟨[(4980, (-10000000000000000 : ℤ)), (4979, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUTt2r_fwd_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (4981, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUTt2r_fwd_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (4981, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUTt2r_fwd_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (4981, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUTt2r_fwd_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (4981, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUTt2r_fwd_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (4981, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_BUTt2r_fwd_pc
  ⟨[(4981, (-10000000000000000 : ℤ)), (4982, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_BUTt2r_total_pc
  ⟨[(4982, (-10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUTt2r_rev_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (4983, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩
]
theorem chunk145_cost : (chunk145.map cost).sum = (0 : ℤ) := by
  decide +kernel
def chunk146 : List Column := [
  -- R_ENZFM_enzyme_BUTt2r_rev_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (4983, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUTt2r_rev_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (4983, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUTt2r_rev_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (4983, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BUTt2r_rev_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (4983, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_BUTt2r_rev_pc
  ⟨[(4983, (-10000000000000000 : ℤ)), (4982, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_ACACtex_fwd_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (4984, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_ACACtex_fwd_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (4984, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_ACACtex_fwd_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (4984, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_ACACtex_fwd_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (4984, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_ACACtex_fwd_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (4984, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_DLAC_ACACtex_fwd_pc
  ⟨[(4984, (-10000000000000000 : ℤ)), (4985, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_DLAC_ACACtex_total_pc
  ⟨[(4985, (-10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_ACACtex_rev_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (4986, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_ACACtex_rev_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (4986, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_ACACtex_rev_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (4986, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_ACACtex_rev_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (4986, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_ACACtex_rev_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (4986, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_ACACtex_rev_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (4986, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_DLAC_ACACtex_rev_pc
  ⟨[(4986, (-10000000000000000 : ℤ)), (4985, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_ACtex_fwd_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (4987, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_ACtex_fwd_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (4987, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_ACtex_fwd_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (4987, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_ACtex_fwd_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (4987, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_ACtex_fwd_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (4987, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_DLAC_ACtex_fwd_pc
  ⟨[(4987, (-10000000000000000 : ℤ)), (4988, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_DLAC_ACtex_total_pc
  ⟨[(4988, (-10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_ACtex_rev_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (4989, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_ACtex_rev_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (4989, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_ACtex_rev_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (4989, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_ACtex_rev_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (4989, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_ACtex_rev_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (4989, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_DLAC_ACtex_rev_pc
  ⟨[(4989, (-10000000000000000 : ℤ)), (4988, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_BUTtex_fwd_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (4990, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_BUTtex_fwd_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (4990, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_BUTtex_fwd_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (4990, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_BUTtex_fwd_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (4990, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_BUTtex_fwd_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (4990, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_DLAC_BUTtex_fwd_pc
  ⟨[(4990, (-10000000000000000 : ℤ)), (4991, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_DLAC_BUTtex_total_pc
  ⟨[(4991, (-10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_BUTtex_rev_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (4992, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_BUTtex_rev_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (4992, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_BUTtex_rev_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (4992, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_BUTtex_rev_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (4992, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_BUTtex_rev_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (4992, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_BUTtex_rev_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (4992, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_GLYCLTtex_fwd_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (4993, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_GLYCLTtex_fwd_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (4993, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_GLYCLTtex_fwd_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (4993, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_GLYCLTtex_fwd_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (4993, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_GLYCLTtex_fwd_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (4993, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_GLYCLTtex_fwd_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (4993, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_DLAC_GLYCLTtex_fwd_pc
  ⟨[(4993, (-10000000000000000 : ℤ)), (4994, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_DLAC_GLYCLTtex_total_pc
  ⟨[(4994, (-10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_GLYCLTtex_rev_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (4995, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_GLYCLTtex_rev_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (4995, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_GLYCLTtex_rev_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (4995, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_GLYCLTtex_rev_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (4995, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_GLYCLTtex_rev_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (4995, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_DLAC_GLYCLTtex_rev_pc
  ⟨[(4995, (-10000000000000000 : ℤ)), (4994, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_PPAtex_fwd_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (4996, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_PPAtex_fwd_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (4996, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_PPAtex_fwd_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (4996, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_PPAtex_fwd_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (4996, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_PPAtex_fwd_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (4996, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩
]
theorem chunk146_cost : (chunk146.map cost).sum = (0 : ℤ) := by
  decide +kernel
def chunk147 : List Column := [
  -- R_ENZDL_enzyme_DLAC_PPAtex_fwd_pc
  ⟨[(4996, (-10000000000000000 : ℤ)), (4997, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_DLAC_PPAtex_total_pc
  ⟨[(4997, (-10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_PPAtex_rev_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (4998, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_PPAtex_rev_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (4998, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_PPAtex_rev_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (4998, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_PPAtex_rev_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (4998, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DLAC_PPAtex_rev_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (4998, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_DLAC_PPAtex_rev_pc
  ⟨[(4998, (-10000000000000000 : ℤ)), (4997, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_D_LACt2_fwd_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (4999, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_D_LACt2_fwd_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (4999, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_D_LACt2_fwd_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (4999, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_D_LACt2_fwd_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (4999, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_D_LACt2_fwd_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (4999, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_D_LACt2_fwd_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (4999, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_D_LACt2_fwd_pc
  ⟨[(4999, (-10000000000000000 : ℤ)), (5000, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_D_LACt2_total_pc
  ⟨[(5000, (-10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_D_LACt2_rev_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5001, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_D_LACt2_rev_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5001, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_D_LACt2_rev_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5001, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_D_LACt2_rev_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5001, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_D_LACt2_rev_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5001, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_D_LACt2_rev_pc
  ⟨[(5001, (-10000000000000000 : ℤ)), (5000, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_GLYCLTt2_fwd_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5002, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_GLYCLTt2_fwd_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5002, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_GLYCLTt2_fwd_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5002, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_GLYCLTt2_fwd_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5002, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_GLYCLTt2_fwd_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5002, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_GLYCLTt2_fwd_pc
  ⟨[(5002, (-10000000000000000 : ℤ)), (5003, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_GLYCLTt2_total_pc
  ⟨[(5003, (-10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_GLYCLTt2_rev_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5004, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_GLYCLTt2_rev_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5004, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_GLYCLTt2_rev_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5004, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_GLYCLTt2_rev_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5004, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_GLYCLTt2_rev_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5004, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_GLYCLTt2_rev_pc
  ⟨[(5004, (-10000000000000000 : ℤ)), (5003, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_H2SUCCt_fwd_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5005, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_H2SUCCt_fwd_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5005, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_H2SUCCt_fwd_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5005, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_H2SUCCt_fwd_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5005, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_H2SUCCt_fwd_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5005, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_H2SUCCt_fwd_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5005, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_H2SUCCt_fwd_pc
  ⟨[(5005, (-10000000000000000 : ℤ)), (5006, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_H2SUCCt_rev_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5007, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_H2SUCCt_rev_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5007, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_H2SUCCt_rev_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5007, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_H2SUCCt_rev_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5007, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_H2SUCCt_rev_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5007, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_H2SUCCt_rev_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5007, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_H2SUCCt_rev_pc
  ⟨[(5007, (-10000000000000000 : ℤ)), (5006, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_2HBtex_fwd_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5008, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_2HBtex_fwd_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5008, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_2HBtex_fwd_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5008, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_2HBtex_fwd_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5008, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_2HBtex_fwd_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5008, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_LLAC_2HBtex_fwd_pc
  ⟨[(5008, (-10000000000000000 : ℤ)), (5009, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_LLAC_2HBtex_total_pc
  ⟨[(5009, (-10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_2HBtex_rev_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5010, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_2HBtex_rev_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5010, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_2HBtex_rev_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5010, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_2HBtex_rev_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5010, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_2HBtex_rev_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5010, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_LLAC_2HBtex_rev_pc
  ⟨[(5010, (-10000000000000000 : ℤ)), (5009, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_5OXPROtex_fwd_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5011, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_5OXPROtex_fwd_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5011, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩
]
theorem chunk147_cost : (chunk147.map cost).sum = (0 : ℤ) := by
  decide +kernel
def chunk148 : List Column := [
  -- R_ENZFM_enzyme_LLAC_5OXPROtex_fwd_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5011, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_5OXPROtex_fwd_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5011, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_5OXPROtex_fwd_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5011, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_5OXPROtex_fwd_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5011, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_LLAC_5OXPROtex_total_pc
  ⟨[(5012, (-10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_5OXPROtex_rev_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5013, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_5OXPROtex_rev_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5013, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_5OXPROtex_rev_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5013, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_5OXPROtex_rev_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5013, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_5OXPROtex_rev_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5013, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_5OXPROtex_rev_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5013, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_LLAC_5OXPROtex_rev_pc
  ⟨[(5013, (-10000000000000000 : ℤ)), (5012, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_ACACtex_fwd_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5014, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_ACACtex_fwd_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5014, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_ACACtex_fwd_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5014, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_ACACtex_fwd_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5014, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_ACACtex_fwd_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5014, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_LLAC_ACACtex_fwd_pc
  ⟨[(5014, (-10000000000000000 : ℤ)), (5015, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_LLAC_ACACtex_total_pc
  ⟨[(5015, (-10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_ACACtex_rev_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5016, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_ACACtex_rev_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5016, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_ACACtex_rev_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5016, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_ACACtex_rev_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5016, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_ACACtex_rev_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5016, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_LLAC_ACACtex_rev_pc
  ⟨[(5016, (-10000000000000000 : ℤ)), (5015, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_ACtex_fwd_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5017, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_ACtex_fwd_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5017, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_ACtex_fwd_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5017, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_ACtex_fwd_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5017, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_ACtex_fwd_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5017, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_LLAC_ACtex_fwd_pc
  ⟨[(5017, (-10000000000000000 : ℤ)), (5018, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_LLAC_ACtex_total_pc
  ⟨[(5018, (-10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_ACtex_rev_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5019, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_ACtex_rev_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5019, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_ACtex_rev_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5019, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_ACtex_rev_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5019, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_ACtex_rev_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5019, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_ACtex_rev_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5019, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_LLAC_ACtex_rev_pc
  ⟨[(5019, (-10000000000000000 : ℤ)), (5018, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_BUTtex_fwd_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5020, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_BUTtex_fwd_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5020, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_BUTtex_fwd_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5020, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_BUTtex_fwd_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5020, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_BUTtex_fwd_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5020, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_LLAC_BUTtex_fwd_pc
  ⟨[(5020, (-10000000000000000 : ℤ)), (5021, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_LLAC_BUTtex_total_pc
  ⟨[(5021, (-10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_BUTtex_rev_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5022, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_BUTtex_rev_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5022, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_BUTtex_rev_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5022, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_BUTtex_rev_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5022, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_BUTtex_rev_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5022, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_LLAC_BUTtex_rev_pc
  ⟨[(5022, (-10000000000000000 : ℤ)), (5021, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_DLACtex_fwd_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5023, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_DLACtex_fwd_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5023, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_DLACtex_fwd_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5023, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_DLACtex_fwd_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5023, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_DLACtex_fwd_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5023, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_LLAC_DLACtex_fwd_pc
  ⟨[(5023, (-10000000000000000 : ℤ)), (5024, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_LLAC_DLACtex_total_pc
  ⟨[(5024, (-10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_DLACtex_rev_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5025, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_DLACtex_rev_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5025, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_DLACtex_rev_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5025, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_DLACtex_rev_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5025, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_DLACtex_rev_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5025, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩
]
theorem chunk148_cost : (chunk148.map cost).sum = (0 : ℤ) := by
  decide +kernel
def chunk149 : List Column := [
  -- R_ENZFM_enzyme_LLAC_DLACtex_rev_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5025, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_GLYCLTtex_fwd_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5026, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_GLYCLTtex_fwd_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5026, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_GLYCLTtex_fwd_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5026, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_GLYCLTtex_fwd_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5026, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_GLYCLTtex_fwd_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5026, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_GLYCLTtex_fwd_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5026, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_LLAC_GLYCLTtex_fwd_pc
  ⟨[(5026, (-10000000000000000 : ℤ)), (5027, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_LLAC_GLYCLTtex_total_pc
  ⟨[(5027, (-10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_GLYCLTtex_rev_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5028, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_GLYCLTtex_rev_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5028, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_GLYCLTtex_rev_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5028, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_GLYCLTtex_rev_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5028, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_GLYCLTtex_rev_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5028, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_LLAC_GLYCLTtex_rev_pc
  ⟨[(5028, (-10000000000000000 : ℤ)), (5027, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_PPAtex_fwd_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5029, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_PPAtex_fwd_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5029, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_PPAtex_fwd_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5029, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_PPAtex_fwd_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5029, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_PPAtex_fwd_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5029, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_LLAC_PPAtex_fwd_pc
  ⟨[(5029, (-10000000000000000 : ℤ)), (5030, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_LLAC_PPAtex_total_pc
  ⟨[(5030, (-10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_PPAtex_rev_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5031, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_PPAtex_rev_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5031, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_PPAtex_rev_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5031, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_PPAtex_rev_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5031, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLAC_PPAtex_rev_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5031, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_LLAC_PPAtex_rev_pc
  ⟨[(5031, (-10000000000000000 : ℤ)), (5030, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_L_LACt2_fwd_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5032, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_L_LACt2_fwd_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5032, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_L_LACt2_fwd_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5032, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_L_LACt2_fwd_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5032, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_L_LACt2_fwd_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5032, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_L_LACt2_fwd_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5032, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_L_LACt2_fwd_pc
  ⟨[(5032, (-10000000000000000 : ℤ)), (5033, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_L_LACt2_total_pc
  ⟨[(5033, (-10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_L_LACt2_rev_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5034, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_L_LACt2_rev_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5034, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_L_LACt2_rev_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5034, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_L_LACt2_rev_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5034, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_L_LACt2_rev_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5034, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_L_LACt2_rev_pc
  ⟨[(5034, (-10000000000000000 : ℤ)), (5033, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPA_ACACtex_fwd_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5035, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPA_ACACtex_fwd_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5035, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPA_ACACtex_fwd_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5035, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPA_ACACtex_fwd_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5035, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPA_ACACtex_fwd_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5035, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PPA_ACACtex_fwd_pc
  ⟨[(5035, (-10000000000000000 : ℤ)), (5036, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PPA_ACACtex_total_pc
  ⟨[(5036, (-10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPA_ACACtex_rev_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5037, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPA_ACACtex_rev_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5037, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPA_ACACtex_rev_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5037, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPA_ACACtex_rev_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5037, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPA_ACACtex_rev_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5037, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PPA_ACACtex_rev_pc
  ⟨[(5037, (-10000000000000000 : ℤ)), (5036, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPA_ACtex_fwd_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5038, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPA_ACtex_fwd_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5038, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPA_ACtex_fwd_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5038, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPA_ACtex_fwd_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5038, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPA_ACtex_fwd_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5038, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPA_ACtex_fwd_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5038, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PPA_ACtex_fwd_pc
  ⟨[(5038, (-10000000000000000 : ℤ)), (5039, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPA_ACtex_rev_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5040, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPA_ACtex_rev_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5040, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩
]
theorem chunk149_cost : (chunk149.map cost).sum = (0 : ℤ) := by
  decide +kernel
def chunk150 : List Column := [
  -- R_ENZFM_enzyme_PPA_ACtex_rev_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5040, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPA_ACtex_rev_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5040, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPA_ACtex_rev_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5040, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPA_ACtex_rev_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5040, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PPA_ACtex_rev_pc
  ⟨[(5040, (-10000000000000000 : ℤ)), (5039, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPA_GLYCLTtex_fwd_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5041, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPA_GLYCLTtex_fwd_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5041, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPA_GLYCLTtex_fwd_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5041, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPA_GLYCLTtex_fwd_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5041, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPA_GLYCLTtex_fwd_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5041, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PPA_GLYCLTtex_fwd_pc
  ⟨[(5041, (-10000000000000000 : ℤ)), (5042, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PPA_GLYCLTtex_total_pc
  ⟨[(5042, (-10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPA_GLYCLTtex_rev_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5043, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPA_GLYCLTtex_rev_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5043, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPA_GLYCLTtex_rev_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5043, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPA_GLYCLTtex_rev_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5043, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPA_GLYCLTtex_rev_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5043, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PPA_GLYCLTtex_rev_pc
  ⟨[(5043, (-10000000000000000 : ℤ)), (5042, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPAt2r_fwd_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5044, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPAt2r_fwd_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5044, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPAt2r_fwd_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5044, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPAt2r_fwd_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5044, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPAt2r_fwd_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5044, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPAt2r_fwd_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5044, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PPAt2r_total_pc
  ⟨[(5045, (-10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPAt2r_rev_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5046, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPAt2r_rev_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5046, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPAt2r_rev_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5046, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPAt2r_rev_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5046, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPAt2r_rev_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5046, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPAt2r_rev_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5046, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PPAt2r_rev_pc
  ⟨[(5046, (-10000000000000000 : ℤ)), (5045, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_2HBtex_fwd_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5047, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_2HBtex_fwd_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5047, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_2HBtex_fwd_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5047, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_2HBtex_fwd_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5047, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_2HBtex_fwd_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5047, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PYR_2HBtex_fwd_pc
  ⟨[(5047, (-10000000000000000 : ℤ)), (5048, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PYR_2HBtex_total_pc
  ⟨[(5048, (-10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_2HBtex_rev_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5049, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_2HBtex_rev_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5049, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_2HBtex_rev_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5049, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_2HBtex_rev_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5049, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_2HBtex_rev_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5049, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PYR_2HBtex_rev_pc
  ⟨[(5049, (-10000000000000000 : ℤ)), (5048, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_2OBUTtex_fwd_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5050, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_2OBUTtex_fwd_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5050, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_2OBUTtex_fwd_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5050, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_2OBUTtex_fwd_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5050, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_2OBUTtex_fwd_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5050, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PYR_2OBUTtex_fwd_pc
  ⟨[(5050, (-10000000000000000 : ℤ)), (5051, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PYR_2OBUTtex_total_pc
  ⟨[(5051, (-10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_2OBUTtex_rev_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5052, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_2OBUTtex_rev_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5052, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_2OBUTtex_rev_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5052, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_2OBUTtex_rev_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5052, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_2OBUTtex_rev_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5052, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_2OBUTtex_rev_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5052, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PYR_2OBUTtex_rev_pc
  ⟨[(5052, (-10000000000000000 : ℤ)), (5051, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_5OXPROtex_fwd_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5053, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_5OXPROtex_fwd_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5053, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_5OXPROtex_fwd_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5053, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_5OXPROtex_fwd_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5053, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_5OXPROtex_fwd_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5053, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩
]
theorem chunk150_cost : (chunk150.map cost).sum = (0 : ℤ) := by
  decide +kernel
def chunk151 : List Column := [
  -- R_ENZDL_enzyme_PYR_5OXPROtex_fwd_pc
  ⟨[(5053, (-10000000000000000 : ℤ)), (5054, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PYR_5OXPROtex_total_pc
  ⟨[(5054, (-10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_5OXPROtex_rev_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5055, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_5OXPROtex_rev_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5055, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_5OXPROtex_rev_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5055, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_5OXPROtex_rev_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5055, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_5OXPROtex_rev_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5055, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PYR_5OXPROtex_rev_pc
  ⟨[(5055, (-10000000000000000 : ℤ)), (5054, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_ACACtex_fwd_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5056, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_ACACtex_fwd_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5056, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_ACACtex_fwd_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5056, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_ACACtex_fwd_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5056, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_ACACtex_fwd_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5056, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PYR_ACACtex_fwd_pc
  ⟨[(5056, (-10000000000000000 : ℤ)), (5057, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PYR_ACACtex_total_pc
  ⟨[(5057, (-10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_ACACtex_rev_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5058, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_ACACtex_rev_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5058, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_ACACtex_rev_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5058, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_ACACtex_rev_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5058, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_ACACtex_rev_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5058, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_ACACtex_rev_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5058, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_ACtex_fwd_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5059, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_ACtex_fwd_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5059, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_ACtex_fwd_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5059, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_ACtex_fwd_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5059, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_ACtex_fwd_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5059, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_ACtex_fwd_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5059, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PYR_ACtex_fwd_pc
  ⟨[(5059, (-10000000000000000 : ℤ)), (5060, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PYR_ACtex_total_pc
  ⟨[(5060, (-10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_ACtex_rev_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5061, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_ACtex_rev_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5061, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_ACtex_rev_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5061, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_ACtex_rev_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5061, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_ACtex_rev_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5061, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PYR_ACtex_rev_pc
  ⟨[(5061, (-10000000000000000 : ℤ)), (5060, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_BUTtex_fwd_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5062, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_BUTtex_fwd_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5062, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_BUTtex_fwd_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5062, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_BUTtex_fwd_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5062, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_BUTtex_fwd_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5062, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PYR_BUTtex_fwd_pc
  ⟨[(5062, (-10000000000000000 : ℤ)), (5063, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PYR_BUTtex_total_pc
  ⟨[(5063, (-10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_BUTtex_rev_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5064, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_BUTtex_rev_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5064, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_BUTtex_rev_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5064, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_BUTtex_rev_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5064, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_BUTtex_rev_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5064, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PYR_BUTtex_rev_pc
  ⟨[(5064, (-10000000000000000 : ℤ)), (5063, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_DLACtex_fwd_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5065, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_DLACtex_fwd_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5065, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_DLACtex_fwd_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5065, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_DLACtex_fwd_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5065, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_DLACtex_fwd_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5065, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_DLACtex_fwd_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5065, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PYR_DLACtex_fwd_pc
  ⟨[(5065, (-10000000000000000 : ℤ)), (5066, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PYR_DLACtex_total_pc
  ⟨[(5066, (-10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_DLACtex_rev_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5067, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_DLACtex_rev_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5067, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_DLACtex_rev_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5067, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_DLACtex_rev_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5067, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_DLACtex_rev_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5067, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PYR_DLACtex_rev_pc
  ⟨[(5067, (-10000000000000000 : ℤ)), (5066, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_GLYCLTtex_fwd_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5068, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_GLYCLTtex_fwd_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5068, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩
]
theorem chunk151_cost : (chunk151.map cost).sum = (0 : ℤ) := by
  decide +kernel
def chunk152 : List Column := [
  -- R_ENZFM_enzyme_PYR_GLYCLTtex_fwd_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5068, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_GLYCLTtex_fwd_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5068, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_GLYCLTtex_fwd_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5068, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PYR_GLYCLTtex_fwd_pc
  ⟨[(5068, (-10000000000000000 : ℤ)), (5069, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PYR_GLYCLTtex_total_pc
  ⟨[(5069, (-10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_GLYCLTtex_rev_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5070, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_GLYCLTtex_rev_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5070, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_GLYCLTtex_rev_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5070, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_GLYCLTtex_rev_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5070, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_GLYCLTtex_rev_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5070, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PYR_GLYCLTtex_rev_pc
  ⟨[(5070, (-10000000000000000 : ℤ)), (5069, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_LLACtex_fwd_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5071, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_LLACtex_fwd_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5071, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_LLACtex_fwd_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5071, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_LLACtex_fwd_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5071, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_LLACtex_fwd_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5071, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_LLACtex_fwd_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5071, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PYR_LLACtex_fwd_pc
  ⟨[(5071, (-10000000000000000 : ℤ)), (5072, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_LLACtex_rev_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5073, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_LLACtex_rev_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5073, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_LLACtex_rev_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5073, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_LLACtex_rev_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5073, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_LLACtex_rev_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5073, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_LLACtex_rev_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5073, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PYR_LLACtex_rev_pc
  ⟨[(5073, (-10000000000000000 : ℤ)), (5072, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_PPAtex_fwd_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5074, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_PPAtex_fwd_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5074, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_PPAtex_fwd_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5074, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_PPAtex_fwd_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5074, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_PPAtex_fwd_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5074, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PYR_PPAtex_fwd_pc
  ⟨[(5074, (-10000000000000000 : ℤ)), (5075, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PYR_PPAtex_total_pc
  ⟨[(5075, (-10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_PPAtex_rev_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5076, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_PPAtex_rev_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5076, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_PPAtex_rev_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5076, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_PPAtex_rev_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5076, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYR_PPAtex_rev_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5076, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PYR_PPAtex_rev_pc
  ⟨[(5076, (-10000000000000000 : ℤ)), (5075, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYRt2_fwd_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5077, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYRt2_fwd_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5077, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYRt2_fwd_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5077, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYRt2_fwd_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5077, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYRt2_fwd_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5077, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYRt2_fwd_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5077, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PYRt2_total_pc
  ⟨[(5078, (-10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYRt2_rev_cplx_HETEROTETRAMER_SLC16A1_BSG_pc
  ⟨[(3094, (-14958864636821000 : ℤ)), (5079, (10000000000000000 : ℤ))], (0 : ℤ), (27729870341112950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYRt2_rev_cplx_HETEROTETRAMER_SLC16A7_BSG_pc
  ⟨[(3095, (-14755482645168300 : ℤ)), (5079, (10000000000000000 : ℤ))], (0 : ℤ), (28614283929852800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYRt2_rev_cplx_HETEROTETRAMER_SLC16A1_EMB_pc
  ⟨[(3221, (-14335031733732800 : ℤ)), (5079, (10000000000000000 : ℤ))], (0 : ℤ), (28936620757747650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYRt2_rev_cplx_HETEROTETRAMER_SLC16A7_EMB_pc
  ⟨[(3222, (-14128713646031000 : ℤ)), (5079, (10000000000000000 : ℤ))], (0 : ℤ), (29883652575085550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYRt2_rev_cplx_HOMODIMER_SLC16A1_pc
  ⟨[(3730, (-9699248835286960 : ℤ)), (5079, (10000000000000000 : ℤ))], (0 : ℤ), (42766958954613950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYRt2_rev_cplx_HOMODIMER_SLC16A7_pc
  ⟨[(3732, (-9463844550979980 : ℤ)), (5079, (10000000000000000 : ℤ))], (0 : ℤ), (44613747368361050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PYRt2_rev_pc
  ⟨[(5079, (-10000000000000000 : ℤ)), (5078, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_SERPT_fwd_pc
  ⟨[(5080, (-10000000000000000 : ℤ)), (5081, (10000000000000000 : ℤ))], (0 : ℤ), (20388842471276000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_SERPT_total_pc
  ⟨[(5081, (-10000000000000000 : ℤ))], (0 : ℤ), (20388842471276000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_SERPT_rev_pc
  ⟨[(5082, (-10000000000000000 : ℤ)), (5081, (10000000000000000 : ℤ))], (0 : ℤ), (20388842471276000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_GTPCH1_fwd_cplx_HOMODECAMER_GCH1_pc
  ⟨[(3280, (-19779748417343400 : ℤ)), (5083, (10000000000000000 : ℤ))], (0 : ℤ), (7988121306717650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_GTPCH1_fwd_pc
  ⟨[(5083, (-10000000000000000 : ℤ)), (5084, (10000000000000000 : ℤ))], (0 : ℤ), (7988121306717650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_GTPCH1_total_pc
  ⟨[(5084, (-10000000000000000 : ℤ))], (0 : ℤ), (7988121306717650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_GTPCH1_rev_pc
  ⟨[(5085, (-10000000000000000 : ℤ)), (5084, (10000000000000000 : ℤ))], (0 : ℤ), (1997030326679415000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_GTPCH2_fwd_cplx_HOMODECAMER_GCH1_pc
  ⟨[(3280, (-19779748417343400 : ℤ)), (5086, (10000000000000000 : ℤ))], (0 : ℤ), (7988121306717650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_GTPCH2_fwd_pc
  ⟨[(5086, (-10000000000000000 : ℤ)), (5087, (10000000000000000 : ℤ))], (0 : ℤ), (7988121306717650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_GTPCH2_rev_pc
  ⟨[(5088, (-10000000000000000 : ℤ)), (5087, (10000000000000000 : ℤ))], (0 : ℤ), (1997030326679415000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_GTPCH3_fwd_cplx_HOMODECAMER_GCH1_pc
  ⟨[(3280, (-19779748417343400 : ℤ)), (5089, (10000000000000000 : ℤ))], (0 : ℤ), (7988121306717650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_GTPCH3_fwd_pc
  ⟨[(5089, (-10000000000000000 : ℤ)), (5090, (10000000000000000 : ℤ))], (0 : ℤ), (7988121306717650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩
]
theorem chunk152_cost : (chunk152.map cost).sum = (0 : ℤ) := by
  decide +kernel
def chunk153 : List Column := [
  -- R_ENZDL_enzyme_GTPCH3_total_pc
  ⟨[(5090, (-10000000000000000 : ℤ))], (0 : ℤ), (7988121306717650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_GTPCH3_rev_pc
  ⟨[(5091, (-10000000000000000 : ℤ)), (5090, (10000000000000000 : ℤ))], (0 : ℤ), (1997030326679415000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_GTPCH4_fwd_cplx_HOMODECAMER_GCH1_pc
  ⟨[(3280, (-19779748417343400 : ℤ)), (5092, (10000000000000000 : ℤ))], (0 : ℤ), (7988121306717650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_GTPCH4_fwd_pc
  ⟨[(5092, (-10000000000000000 : ℤ)), (5093, (10000000000000000 : ℤ))], (0 : ℤ), (7988121306717650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_GTPCH4_total_pc
  ⟨[(5093, (-10000000000000000 : ℤ))], (0 : ℤ), (7988121306717650000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_GTPCH4_rev_pc
  ⟨[(5094, (-10000000000000000 : ℤ)), (5093, (10000000000000000 : ℤ))], (0 : ℤ), (1997030326679415000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_GLNS_fwd_pc
  ⟨[(5095, (-10000000000000000 : ℤ)), (5096, (10000000000000000 : ℤ))], (0 : ℤ), (3936573681918810000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_GLNS_total_pc
  ⟨[(5096, (-10000000000000000 : ℤ))], (0 : ℤ), (3936573681918810000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_GLNS_rev_pc
  ⟨[(5097, (-10000000000000000 : ℤ)), (5096, (10000000000000000 : ℤ))], (0 : ℤ), (3936573681918810000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_HPROy_fwd_cplx_HOMODECAMER_PYCR3_pc
  ⟨[(3670, (-20181460260264600 : ℤ)), (5098, (10000000000000000 : ℤ))], (0 : ℤ), (7733565342122300000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_HPROy_fwd_pc
  ⟨[(5098, (-10000000000000000 : ℤ)), (5099, (10000000000000000 : ℤ))], (0 : ℤ), (7733565342122300000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_HPROy_total_pc
  ⟨[(5099, (-10000000000000000 : ℤ))], (0 : ℤ), (7733565342122300000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_HPROy_rev_pc
  ⟨[(5100, (-10000000000000000 : ℤ)), (5099, (10000000000000000 : ℤ))], (0 : ℤ), (7733565342122300000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_P5CRx_fwd_cplx_HOMODECAMER_PYCR3_pc
  ⟨[(3670, (-20181460260264600 : ℤ)), (5101, (10000000000000000 : ℤ))], (0 : ℤ), (7733565342122300000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_P5CRx_total_pc
  ⟨[(5102, (-10000000000000000 : ℤ))], (0 : ℤ), (7733565342122300000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_P5CRx_rev_pc
  ⟨[(5103, (-10000000000000000 : ℤ)), (5102, (10000000000000000 : ℤ))], (0 : ℤ), (7733565342122300000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_P5CRy_fwd_cplx_HOMODECAMER_PYCR3_pc
  ⟨[(3670, (-20181460260264600 : ℤ)), (5104, (10000000000000000 : ℤ))], (0 : ℤ), (7733565342122300000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_P5CRy_fwd_pc
  ⟨[(5104, (-10000000000000000 : ℤ)), (5105, (10000000000000000 : ℤ))], (0 : ℤ), (7733565342122300000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_P5CRy_total_pc
  ⟨[(5105, (-10000000000000000 : ℤ))], (0 : ℤ), (7733565342122300000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_P5CRy_rev_pc
  ⟨[(5106, (-10000000000000000 : ℤ)), (5105, (10000000000000000 : ℤ))], (0 : ℤ), (7733565342122300000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_CPPP1ABCte_fwd_cplx_HOMODIMER_ABCB6_pc
  ⟨[(2985, (-14695763412309300 : ℤ)), (5107, (10000000000000000 : ℤ))], (0 : ℤ), (16426650085223250000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_CPPP1ABCte_fwd_pc
  ⟨[(5107, (-10000000000000000 : ℤ)), (5108, (10000000000000000 : ℤ))], (0 : ℤ), (16426650085223250000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_CPPP1ABCte_total_pc
  ⟨[(5108, (-10000000000000000 : ℤ))], (0 : ℤ), (16426650085223250000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_CPPP3ABCte_fwd_cplx_HOMODIMER_ABCB6_pc
  ⟨[(2985, (-14695763412309300 : ℤ)), (5110, (10000000000000000 : ℤ))], (0 : ℤ), (16426650085223250000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_CPPP3ABCte_fwd_pc
  ⟨[(5110, (-10000000000000000 : ℤ)), (5111, (10000000000000000 : ℤ))], (0 : ℤ), (16426650085223250000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_CPPP3ABCte_total_pc
  ⟨[(5111, (-10000000000000000 : ℤ))], (0 : ℤ), (16426650085223250000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_CPPP3ABCte_rev_pc
  ⟨[(5112, (-10000000000000000 : ℤ)), (5111, (10000000000000000 : ℤ))], (0 : ℤ), (16426650085223250000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_CPPPG3ABCte_fwd_cplx_HOMODIMER_ABCB6_pc
  ⟨[(2985, (-14695763412309300 : ℤ)), (5113, (10000000000000000 : ℤ))], (0 : ℤ), (16426650085223250000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_CPPPG3ABCte_fwd_pc
  ⟨[(5113, (-10000000000000000 : ℤ)), (5114, (10000000000000000 : ℤ))], (0 : ℤ), (16426650085223250000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_CPPPG3ABCte_total_pc
  ⟨[(5114, (-10000000000000000 : ℤ))], (0 : ℤ), (16426650085223250000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_CPPPG3ABCte_rev_pc
  ⟨[(5115, (-10000000000000000 : ℤ)), (5114, (10000000000000000 : ℤ))], (0 : ℤ), (2267795429947020000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_UPP1ABCte_fwd_cplx_HOMODIMER_ABCB6_pc
  ⟨[(2985, (-14695763412309300 : ℤ)), (5116, (10000000000000000 : ℤ))], (0 : ℤ), (16426650085223250000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_UPP1ABCte_total_pc
  ⟨[(5117, (-10000000000000000 : ℤ))], (0 : ℤ), (16426650085223250000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_UPP1ABCte_rev_pc
  ⟨[(5118, (-10000000000000000 : ℤ)), (5117, (10000000000000000 : ℤ))], (0 : ℤ), (2267795429947020000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_UPP3ABCte_fwd_cplx_HOMODIMER_ABCB6_pc
  ⟨[(2985, (-14695763412309300 : ℤ)), (5119, (10000000000000000 : ℤ))], (0 : ℤ), (16426650085223250000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_UPP3ABCte_fwd_pc
  ⟨[(5119, (-10000000000000000 : ℤ)), (5120, (10000000000000000 : ℤ))], (0 : ℤ), (16426650085223250000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_UPP3ABCte_total_pc
  ⟨[(5120, (-10000000000000000 : ℤ))], (0 : ℤ), (16426650085223250000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_UPP3ABCte_rev_pc
  ⟨[(5121, (-10000000000000000 : ℤ)), (5120, (10000000000000000 : ℤ))], (0 : ℤ), (2267795429947020000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_FE2PHEMEABCte_fwd_cplx_HOMODIMER_ABCB6_pc
  ⟨[(2985, (-14695763412309300 : ℤ)), (5122, (10000000000000000 : ℤ))], (0 : ℤ), (16426650085223250000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_FE2PHEMEABCte_fwd_cplx_HOMOTETRAMER_ABCG2_pc
  ⟨[(2990, (-20321650429028500 : ℤ)), (5122, (10000000000000000 : ℤ))], (0 : ℤ), (7590087495916500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_FE2PHEMEABCte_fwd_pc
  ⟨[(5122, (-10000000000000000 : ℤ)), (5123, (10000000000000000 : ℤ))], (0 : ℤ), (23974129999648450000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_FE2PHEMEABCte_rev_pc
  ⟨[(5124, (-10000000000000000 : ℤ)), (5123, (10000000000000000 : ℤ))], (0 : ℤ), (0 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_HEMATINABCte_fwd_cplx_HOMODIMER_ABCB6_pc
  ⟨[(2985, (-14695763412309300 : ℤ)), (5125, (10000000000000000 : ℤ))], (0 : ℤ), (16426650085223250000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_HEMATINABCte_fwd_cplx_HOMOTETRAMER_ABCG2_pc
  ⟨[(2990, (-20321650429028500 : ℤ)), (5125, (10000000000000000 : ℤ))], (0 : ℤ), (7590087495916500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_HEMATINABCte_fwd_pc
  ⟨[(5125, (-10000000000000000 : ℤ)), (5126, (10000000000000000 : ℤ))], (0 : ℤ), (23974129999648450000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_HEMATINABCte_total_pc
  ⟨[(5126, (-10000000000000000 : ℤ))], (0 : ℤ), (23974129999648450000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_HEMATINABCte_rev_pc
  ⟨[(5127, (-10000000000000000 : ℤ)), (5126, (10000000000000000 : ℤ))], (0 : ℤ), (23974129999648450000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPP9ABCte_fwd_cplx_HOMODIMER_ABCB6_pc
  ⟨[(2985, (-14695763412309300 : ℤ)), (5128, (10000000000000000 : ℤ))], (0 : ℤ), (16426650085223250000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPP9ABCte_fwd_cplx_HOMOTETRAMER_ABCG2_pc
  ⟨[(2990, (-20321650429028500 : ℤ)), (5128, (10000000000000000 : ℤ))], (0 : ℤ), (7590087495916500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PPP9ABCte_total_pc
  ⟨[(5129, (-10000000000000000 : ℤ))], (0 : ℤ), (23974129999648450000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PPP9ABCte_rev_pc
  ⟨[(5130, (-10000000000000000 : ℤ)), (5129, (10000000000000000 : ℤ))], (0 : ℤ), (0 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ACHEe_fwd_cplx_HOMODIMER_ACHE_pc
  ⟨[(2998, (-11456809280139900 : ℤ)), (5131, (10000000000000000 : ℤ))], (0 : ℤ), (30188518043718350000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_ACHEe_fwd_pc
  ⟨[(5131, (-10000000000000000 : ℤ)), (5132, (10000000000000000 : ℤ))], (0 : ℤ), (30188518043718350000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_ACHEe_total_pc
  ⟨[(5132, (-10000000000000000 : ℤ))], (0 : ℤ), (30188518043718350000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_ACHEe_rev_pc
  ⟨[(5133, (-10000000000000000 : ℤ)), (5132, (10000000000000000 : ℤ))], (0 : ℤ), (30188518043718350000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ACMDAC_fwd_cplx_HOMODIMER_ACY1_pc
  ⟨[(3013, (-8588020136982710 : ℤ)), (5134, (10000000000000000 : ℤ))], (0 : ℤ), (55959776742670500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_ACMDAC_fwd_pc
  ⟨[(5134, (-10000000000000000 : ℤ)), (5135, (10000000000000000 : ℤ))], (0 : ℤ), (55959776742670500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_ACMDAC_total_pc
  ⟨[(5135, (-10000000000000000 : ℤ))], (0 : ℤ), (55959776742670500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_NACCYSDAC_fwd_cplx_HOMODIMER_ACY1_pc
  ⟨[(3013, (-8588020136982710 : ℤ)), (5137, (10000000000000000 : ℤ))], (0 : ℤ), (55959776742670500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_NACCYSDAC_fwd_pc
  ⟨[(5137, (-10000000000000000 : ℤ)), (5138, (10000000000000000 : ℤ))], (0 : ℤ), (55959776742670500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_NACCYSDAC_total_pc
  ⟨[(5138, (-10000000000000000 : ℤ))], (0 : ℤ), (55959776742670500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_NACCYSDAC_rev_pc
  ⟨[(5139, (-10000000000000000 : ℤ)), (5138, (10000000000000000 : ℤ))], (0 : ℤ), (55959776742670500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ALCD2x_fwd_cplx_HOMODIMER_ADH5_pc
  ⟨[(3019, (-7709373723324390 : ℤ)), (5140, (10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_ALCD2x_fwd_pc
  ⟨[(5140, (-10000000000000000 : ℤ)), (5141, (10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩
]
theorem chunk153_cost : (chunk153.map cost).sum = (0 : ℤ) := by
  decide +kernel
def chunk154 : List Column := [
  -- R_ENZDL_enzyme_ALCD2x_total_pc
  ⟨[(5141, (-10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_ALCD2x_rev_pc
  ⟨[(5142, (-10000000000000000 : ℤ)), (5141, (10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_FAWOXx_10_10OH_fwd_cplx_HOMODIMER_ADH5_pc
  ⟨[(3019, (-7709373723324390 : ℤ)), (5143, (10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_FAWOXx_10_10OH_total_pc
  ⟨[(5144, (-10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_FAWOXx_10_10OH_rev_pc
  ⟨[(5145, (-10000000000000000 : ℤ)), (5144, (10000000000000000 : ℤ))], (0 : ℤ), (0 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_FAWOXx_10_10OXO_fwd_cplx_HOMODIMER_ADH5_pc
  ⟨[(3019, (-7709373723324390 : ℤ)), (5146, (10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_FAWOXx_10_10OXO_fwd_pc
  ⟨[(5146, (-10000000000000000 : ℤ)), (5147, (10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_FAWOXx_10_10OXO_total_pc
  ⟨[(5147, (-10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_FAWOXx_10_10OXO_rev_pc
  ⟨[(5148, (-10000000000000000 : ℤ)), (5147, (10000000000000000 : ℤ))], (0 : ℤ), (0 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_FAWOXx_12_12OH_fwd_cplx_HOMODIMER_ADH5_pc
  ⟨[(3019, (-7709373723324390 : ℤ)), (5149, (10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_FAWOXx_12_12OH_fwd_pc
  ⟨[(5149, (-10000000000000000 : ℤ)), (5150, (10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_FAWOXx_12_12OH_rev_pc
  ⟨[(5151, (-10000000000000000 : ℤ)), (5150, (10000000000000000 : ℤ))], (0 : ℤ), (0 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_FAWOXx_12_12OXO_fwd_cplx_HOMODIMER_ADH5_pc
  ⟨[(3019, (-7709373723324390 : ℤ)), (5152, (10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_FAWOXx_12_12OXO_fwd_pc
  ⟨[(5152, (-10000000000000000 : ℤ)), (5153, (10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_FAWOXx_12_12OXO_total_pc
  ⟨[(5153, (-10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_FAWOXx_12_12OXO_rev_pc
  ⟨[(5154, (-10000000000000000 : ℤ)), (5153, (10000000000000000 : ℤ))], (0 : ℤ), (0 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_FAWOXx_14_14OH_fwd_cplx_HOMODIMER_ADH5_pc
  ⟨[(3019, (-7709373723324390 : ℤ)), (5155, (10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_FAWOXx_14_14OH_fwd_pc
  ⟨[(5155, (-10000000000000000 : ℤ)), (5156, (10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_FAWOXx_14_14OH_total_pc
  ⟨[(5156, (-10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_FAWOXx_14_14OH_rev_pc
  ⟨[(5157, (-10000000000000000 : ℤ)), (5156, (10000000000000000 : ℤ))], (0 : ℤ), (0 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_FAWOXx_14_14OXO_fwd_pc
  ⟨[(5158, (-10000000000000000 : ℤ)), (5159, (10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_FAWOXx_14_14OXO_total_pc
  ⟨[(5159, (-10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_FAWOXx_14_14OXO_rev_pc
  ⟨[(5160, (-10000000000000000 : ℤ)), (5159, (10000000000000000 : ℤ))], (0 : ℤ), (0 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_FAWOXx_16_016OH_fwd_cplx_HOMODIMER_ADH5_pc
  ⟨[(3019, (-7709373723324390 : ℤ)), (5161, (10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_FAWOXx_16_016OH_fwd_pc
  ⟨[(5161, (-10000000000000000 : ℤ)), (5162, (10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_FAWOXx_16_016OH_total_pc
  ⟨[(5162, (-10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_FAWOXx_16_016OH_rev_pc
  ⟨[(5163, (-10000000000000000 : ℤ)), (5162, (10000000000000000 : ℤ))], (0 : ℤ), (0 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_FAWOXx_16_016OXO_fwd_cplx_HOMODIMER_ADH5_pc
  ⟨[(3019, (-7709373723324390 : ℤ)), (5164, (10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_FAWOXx_16_016OXO_fwd_pc
  ⟨[(5164, (-10000000000000000 : ℤ)), (5165, (10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_FAWOXx_16_016OXO_rev_pc
  ⟨[(5166, (-10000000000000000 : ℤ)), (5165, (10000000000000000 : ℤ))], (0 : ℤ), (0 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_FAWOXx_20_5Z8Z11Z14Z20OH_fwd_cplx_HOMODIMER_ADH5_pc
  ⟨[(3019, (-7709373723324390 : ℤ)), (5167, (10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_FAWOXx_20_5Z8Z11Z14Z20OH_fwd_pc
  ⟨[(5167, (-10000000000000000 : ℤ)), (5168, (10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_FAWOXx_20_5Z8Z11Z14Z20OH_total_pc
  ⟨[(5168, (-10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_FAWOXx_20_5Z8Z11Z14Z20OH_rev_pc
  ⟨[(5169, (-10000000000000000 : ℤ)), (5168, (10000000000000000 : ℤ))], (0 : ℤ), (0 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_FAWOXx_20_5Z8Z11Z14Z20OXO_fwd_cplx_HOMODIMER_ADH5_pc
  ⟨[(3019, (-7709373723324390 : ℤ)), (5170, (10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_FAWOXx_20_5Z8Z11Z14Z20OXO_fwd_pc
  ⟨[(5170, (-10000000000000000 : ℤ)), (5171, (10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_FAWOXx_20_5Z8Z11Z14Z20OXO_total_pc
  ⟨[(5171, (-10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_FAWOXx_22_22OH_fwd_cplx_HOMODIMER_ADH5_pc
  ⟨[(3019, (-7709373723324390 : ℤ)), (5173, (10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_FAWOXx_22_22OH_fwd_pc
  ⟨[(5173, (-10000000000000000 : ℤ)), (5174, (10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_FAWOXx_22_22OH_total_pc
  ⟨[(5174, (-10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_FAWOXx_22_22OH_rev_pc
  ⟨[(5175, (-10000000000000000 : ℤ)), (5174, (10000000000000000 : ℤ))], (0 : ℤ), (0 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_FAWOXx_22_22OXO_fwd_cplx_HOMODIMER_ADH5_pc
  ⟨[(3019, (-7709373723324390 : ℤ)), (5176, (10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_FAWOXx_22_22OXO_fwd_pc
  ⟨[(5176, (-10000000000000000 : ℤ)), (5177, (10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_FAWOXx_22_22OXO_total_pc
  ⟨[(5177, (-10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_FAWOXx_22_22OXO_rev_pc
  ⟨[(5178, (-10000000000000000 : ℤ)), (5177, (10000000000000000 : ℤ))], (0 : ℤ), (0 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_GTHNORDx_fwd_cplx_HOMODIMER_ADH5_pc
  ⟨[(3019, (-7709373723324390 : ℤ)), (5179, (10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_GTHNORDx_total_pc
  ⟨[(5180, (-10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_GTHNORDx_rev_pc
  ⟨[(5181, (-10000000000000000 : ℤ)), (5180, (10000000000000000 : ℤ))], (0 : ℤ), (0 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_HMGTHDH_fwd_cplx_HOMODIMER_ADH5_pc
  ⟨[(3019, (-7709373723324390 : ℤ)), (5182, (10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_HMGTHDH_fwd_pc
  ⟨[(5182, (-10000000000000000 : ℤ)), (5183, (10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_HMGTHDH_total_pc
  ⟨[(5183, (-10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_HMGTHDH_rev_cplx_HOMODIMER_ADH5_pc
  ⟨[(3019, (-7709373723324390 : ℤ)), (5184, (10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_HMGTHDH_rev_pc
  ⟨[(5184, (-10000000000000000 : ℤ)), (5183, (10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LALDO_fwd_cplx_HOMODIMER_ADH5_pc
  ⟨[(3019, (-7709373723324390 : ℤ)), (5185, (10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_LALDO_fwd_pc
  ⟨[(5185, (-10000000000000000 : ℤ)), (5186, (10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_LALDO_rev_pc
  ⟨[(5187, (-10000000000000000 : ℤ)), (5186, (10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LCARR_fwd_cplx_HOMODIMER_ADH5_pc
  ⟨[(3019, (-7709373723324390 : ℤ)), (5188, (10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_LCARR_fwd_pc
  ⟨[(5188, (-10000000000000000 : ℤ)), (5189, (10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_LCARR_total_pc
  ⟨[(5189, (-10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_LCARR_rev_pc
  ⟨[(5190, (-10000000000000000 : ℤ)), (5189, (10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LCARS_fwd_cplx_HOMODIMER_ADH5_pc
  ⟨[(3019, (-7709373723324390 : ℤ)), (5191, (10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_LCARS_fwd_pc
  ⟨[(5191, (-10000000000000000 : ℤ)), (5192, (10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_LCARS_total_pc
  ⟨[(5192, (-10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_LCARS_rev_pc
  ⟨[(5193, (-10000000000000000 : ℤ)), (5192, (10000000000000000 : ℤ))], (0 : ℤ), (79335928871861000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩
]
theorem chunk154_cost : (chunk154.map cost).sum = (0 : ℤ) := by
  decide +kernel
def chunk155 : List Column := [
  -- R_ENZDL_enzyme_ADSS_fwd_pc
  ⟨[(5194, (-10000000000000000 : ℤ)), (5195, (10000000000000000 : ℤ))], (0 : ℤ), (47973475988546850000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_ADSS_total_pc
  ⟨[(5195, (-10000000000000000 : ℤ))], (0 : ℤ), (47973475988546850000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_ADSS_rev_pc
  ⟨[(5196, (-10000000000000000 : ℤ)), (5195, (10000000000000000 : ℤ))], (0 : ℤ), (12942964453866050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_FKYNH_fwd_cplx_HOMODIMER_AFMID_pc
  ⟨[(3027, (-6857426554444390 : ℤ)), (5197, (10000000000000000 : ℤ))], (0 : ℤ), (94605644362546500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_FKYNH_fwd_pc
  ⟨[(5197, (-10000000000000000 : ℤ)), (5198, (10000000000000000 : ℤ))], (0 : ℤ), (94605644362546500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_FKYNH_total_pc
  ⟨[(5198, (-10000000000000000 : ℤ))], (0 : ℤ), (94605644362546500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_FKYNH_rev_pc
  ⟨[(5199, (-10000000000000000 : ℤ)), (5198, (10000000000000000 : ℤ))], (0 : ℤ), (0 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_MACOXO_fwd_cplx_HOMODIMER_ALDH3A1_pc
  ⟨[(3045, (-9214602176606620 : ℤ)), (5200, (10000000000000000 : ℤ))], (0 : ℤ), (47480402198676800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_MACOXO_fwd_cplx_MONOMER_ALDH3B1_pc
  ⟨[(3047, (-5596926666141710 : ℤ)), (5200, (10000000000000000 : ℤ))], (0 : ℤ), (151965146815627500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_MACOXO_fwd_pc
  ⟨[(5200, (-10000000000000000 : ℤ)), (5201, (10000000000000000 : ℤ))], (0 : ℤ), (240377178250182000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_MACOXO_total_pc
  ⟨[(5201, (-10000000000000000 : ℤ))], (0 : ℤ), (240377178250182000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_MACOXO_rev_pc
  ⟨[(5202, (-10000000000000000 : ℤ)), (5201, (10000000000000000 : ℤ))], (0 : ℤ), (199300124639577000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_34DHALDDx_fwd_cplx_HOMODIMER_ALDH3A1_pc
  ⟨[(3045, (-9214602176606620 : ℤ)), (5203, (10000000000000000 : ℤ))], (0 : ℤ), (47480402198676800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_34DHALDDx_fwd_cplx_MONOMER_ALDH3B1_pc
  ⟨[(3047, (-5596926666141710 : ℤ)), (5203, (10000000000000000 : ℤ))], (0 : ℤ), (151965146815627500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_34DHALDDx_fwd_pc
  ⟨[(5203, (-10000000000000000 : ℤ)), (5204, (10000000000000000 : ℤ))], (0 : ℤ), (199445549014304500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_34DHALDDx_total_pc
  ⟨[(5204, (-10000000000000000 : ℤ))], (0 : ℤ), (199445549014304500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_34DHALDDx_rev_pc
  ⟨[(5205, (-10000000000000000 : ℤ)), (5204, (10000000000000000 : ℤ))], (0 : ℤ), (197884366797296000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_34DHALDDy_fwd_cplx_MONOMER_ALDH3B1_pc
  ⟨[(3047, (-5596926666141710 : ℤ)), (5206, (10000000000000000 : ℤ))], (0 : ℤ), (151965146815627500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_34DHALDDy_fwd_pc
  ⟨[(5206, (-10000000000000000 : ℤ)), (5207, (10000000000000000 : ℤ))], (0 : ℤ), (199445549014304500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_34DHALDDy_total_pc
  ⟨[(5207, (-10000000000000000 : ℤ))], (0 : ℤ), (199445549014304500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_34DHALDDy_rev_pc
  ⟨[(5208, (-10000000000000000 : ℤ)), (5207, (10000000000000000 : ℤ))], (0 : ℤ), (198333437713707000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_34DHXMANDACOXx_fwd_cplx_HOMODIMER_ALDH3A1_pc
  ⟨[(3045, (-9214602176606620 : ℤ)), (5209, (10000000000000000 : ℤ))], (0 : ℤ), (47480402198676800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_34DHXMANDACOXx_fwd_cplx_MONOMER_ALDH3B1_pc
  ⟨[(3047, (-5596926666141710 : ℤ)), (5209, (10000000000000000 : ℤ))], (0 : ℤ), (151965146815627500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_34DHXMANDACOXx_fwd_pc
  ⟨[(5209, (-10000000000000000 : ℤ)), (5210, (10000000000000000 : ℤ))], (0 : ℤ), (199445549014304500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_34DHXMANDACOXx_total_pc
  ⟨[(5210, (-10000000000000000 : ℤ))], (0 : ℤ), (199445549014304500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_34DHXMANDACOXx_rev_pc
  ⟨[(5211, (-10000000000000000 : ℤ)), (5210, (10000000000000000 : ℤ))], (0 : ℤ), (198703015834852000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_34DHXMANDACOXy_fwd_cplx_MONOMER_ALDH3B1_pc
  ⟨[(3047, (-5596926666141710 : ℤ)), (5212, (10000000000000000 : ℤ))], (0 : ℤ), (151965146815627500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_34DHXMANDACOXy_fwd_pc
  ⟨[(5212, (-10000000000000000 : ℤ)), (5213, (10000000000000000 : ℤ))], (0 : ℤ), (199445549014304500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_34DHXMANDACOXy_total_pc
  ⟨[(5213, (-10000000000000000 : ℤ))], (0 : ℤ), (199445549014304500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_34DHXMANDACOXy_rev_pc
  ⟨[(5214, (-10000000000000000 : ℤ)), (5213, (10000000000000000 : ℤ))], (0 : ℤ), (198860518101962500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_3M4HDXPACx_fwd_cplx_HOMODIMER_ALDH3A1_pc
  ⟨[(3045, (-9214602176606620 : ℤ)), (5215, (10000000000000000 : ℤ))], (0 : ℤ), (47480402198676800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_3M4HDXPACx_fwd_cplx_MONOMER_ALDH3B1_pc
  ⟨[(3047, (-5596926666141710 : ℤ)), (5215, (10000000000000000 : ℤ))], (0 : ℤ), (151965146815627500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_3M4HDXPACx_fwd_pc
  ⟨[(5215, (-10000000000000000 : ℤ)), (5216, (10000000000000000 : ℤ))], (0 : ℤ), (199445549014304500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_3M4HDXPACx_total_pc
  ⟨[(5216, (-10000000000000000 : ℤ))], (0 : ℤ), (199445549014304500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_3M4HDXPACy_fwd_cplx_HOMODIMER_ALDH3A1_pc
  ⟨[(3045, (-9214602176606620 : ℤ)), (5218, (10000000000000000 : ℤ))], (0 : ℤ), (47480402198676800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_3M4HDXPACy_fwd_cplx_MONOMER_ALDH3B1_pc
  ⟨[(3047, (-5596926666141710 : ℤ)), (5218, (10000000000000000 : ℤ))], (0 : ℤ), (151965146815627500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_3M4HDXPACy_fwd_pc
  ⟨[(5218, (-10000000000000000 : ℤ)), (5219, (10000000000000000 : ℤ))], (0 : ℤ), (199445549014304500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_3M4HDXPACy_total_pc
  ⟨[(5219, (-10000000000000000 : ℤ))], (0 : ℤ), (199445549014304500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_3M4HDXPACy_rev_pc
  ⟨[(5220, (-10000000000000000 : ℤ)), (5219, (10000000000000000 : ℤ))], (0 : ℤ), (198333437713707000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_4HOXPACDORx_fwd_cplx_HOMODIMER_ALDH3A1_pc
  ⟨[(3045, (-9214602176606620 : ℤ)), (5221, (10000000000000000 : ℤ))], (0 : ℤ), (47480402198676800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_4HOXPACDORx_fwd_cplx_MONOMER_ALDH3B1_pc
  ⟨[(3047, (-5596926666141710 : ℤ)), (5221, (10000000000000000 : ℤ))], (0 : ℤ), (151965146815627500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_4HOXPACDORx_fwd_pc
  ⟨[(5221, (-10000000000000000 : ℤ)), (5222, (10000000000000000 : ℤ))], (0 : ℤ), (199445549014304500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_4HOXPACDORx_total_pc
  ⟨[(5222, (-10000000000000000 : ℤ))], (0 : ℤ), (199445549014304500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_4HOXPACDORy_fwd_cplx_HOMODIMER_ALDH3A1_pc
  ⟨[(3045, (-9214602176606620 : ℤ)), (5224, (10000000000000000 : ℤ))], (0 : ℤ), (47480402198676800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_4HOXPACDORy_fwd_cplx_MONOMER_ALDH3B1_pc
  ⟨[(3047, (-5596926666141710 : ℤ)), (5224, (10000000000000000 : ℤ))], (0 : ℤ), (151965146815627500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_4HOXPACDORy_fwd_pc
  ⟨[(5224, (-10000000000000000 : ℤ)), (5225, (10000000000000000 : ℤ))], (0 : ℤ), (199445549014304500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_4HOXPACDORy_total_pc
  ⟨[(5225, (-10000000000000000 : ℤ))], (0 : ℤ), (199445549014304500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_4HOXPACDORy_rev_pc
  ⟨[(5226, (-10000000000000000 : ℤ)), (5225, (10000000000000000 : ℤ))], (0 : ℤ), (0 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ALDD19x_fwd_cplx_HOMODIMER_ALDH3A1_pc
  ⟨[(3045, (-9214602176606620 : ℤ)), (5227, (10000000000000000 : ℤ))], (0 : ℤ), (47480402198676800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ALDD19x_fwd_cplx_MONOMER_ALDH3B1_pc
  ⟨[(3047, (-5596926666141710 : ℤ)), (5227, (10000000000000000 : ℤ))], (0 : ℤ), (151965146815627500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_ALDD19x_fwd_pc
  ⟨[(5227, (-10000000000000000 : ℤ)), (5228, (10000000000000000 : ℤ))], (0 : ℤ), (199445549014304500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_ALDD19x_total_pc
  ⟨[(5228, (-10000000000000000 : ℤ))], (0 : ℤ), (199445549014304500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ALDD19y_fwd_cplx_HOMODIMER_ALDH3A1_pc
  ⟨[(3045, (-9214602176606620 : ℤ)), (5230, (10000000000000000 : ℤ))], (0 : ℤ), (47480402198676800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ALDD19y_fwd_cplx_MONOMER_ALDH3B1_pc
  ⟨[(3047, (-5596926666141710 : ℤ)), (5230, (10000000000000000 : ℤ))], (0 : ℤ), (151965146815627500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_ALDD19y_fwd_pc
  ⟨[(5230, (-10000000000000000 : ℤ)), (5231, (10000000000000000 : ℤ))], (0 : ℤ), (199445549014304500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_ALDD19y_total_pc
  ⟨[(5231, (-10000000000000000 : ℤ))], (0 : ℤ), (199445549014304500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_ALDD19y_rev_pc
  ⟨[(5232, (-10000000000000000 : ℤ)), (5231, (10000000000000000 : ℤ))], (0 : ℤ), (0 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ALDD2y_fwd_cplx_HOMODIMER_ALDH3A1_pc
  ⟨[(3045, (-9214602176606620 : ℤ)), (5233, (10000000000000000 : ℤ))], (0 : ℤ), (47480402198676800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ALDD2y_fwd_cplx_MONOMER_ALDH3B1_pc
  ⟨[(3047, (-5596926666141710 : ℤ)), (5233, (10000000000000000 : ℤ))], (0 : ℤ), (151965146815627500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_ALDD2y_fwd_pc
  ⟨[(5233, (-10000000000000000 : ℤ)), (5234, (10000000000000000 : ℤ))], (0 : ℤ), (199445549014304500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_ALDD2y_rev_pc
  ⟨[(5235, (-10000000000000000 : ℤ)), (5234, (10000000000000000 : ℤ))], (0 : ℤ), (86704030655608500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_RBTDG_Dx_fwd_cplx_HOMODIMER_ALDH3A1_pc
  ⟨[(3045, (-9214602176606620 : ℤ)), (5236, (10000000000000000 : ℤ))], (0 : ℤ), (47480402198676800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_RBTDG_Dx_fwd_cplx_MONOMER_ALDH3B1_pc
  ⟨[(3047, (-5596926666141710 : ℤ)), (5236, (10000000000000000 : ℤ))], (0 : ℤ), (151965146815627500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_RBTDG_Dx_fwd_pc
  ⟨[(5236, (-10000000000000000 : ℤ)), (5237, (10000000000000000 : ℤ))], (0 : ℤ), (199445549014304500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩
]
theorem chunk155_cost : (chunk155.map cost).sum = (0 : ℤ) := by
  decide +kernel
def chunk156 : List Column := [
  -- R_ENZDL_enzyme_RBTDG_Dx_total_pc
  ⟨[(5237, (-10000000000000000 : ℤ))], (0 : ℤ), (199445549014304500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_RBTDG_Dx_rev_pc
  ⟨[(5238, (-10000000000000000 : ℤ)), (5237, (10000000000000000 : ℤ))], (0 : ℤ), (199445549014304500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_FRNSL2E6EDH_fwd_cplx_HOMODIMER_ALDH3A2_pc
  ⟨[(3046, (-9819747365803660 : ℤ)), (5239, (10000000000000000 : ℤ))], (0 : ℤ), (40931629235877900000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_FRNSL2E6EDH_fwd_pc
  ⟨[(5239, (-10000000000000000 : ℤ)), (5240, (10000000000000000 : ℤ))], (0 : ℤ), (40931629235877900000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_FRNSL2E6EDH_total_pc
  ⟨[(5240, (-10000000000000000 : ℤ))], (0 : ℤ), (40931629235877900000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_5HOXINDACTOX_fwd_cplx_HOMODIMER_ALDH3A2_pc
  ⟨[(3046, (-9819747365803660 : ℤ)), (5242, (10000000000000000 : ℤ))], (0 : ℤ), (40931629235877900000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_5HOXINDACTOX_fwd_cplx_HOMOTETRAMER_ALDH9A1_pc
  ⟨[(3048, (-16276437512138200 : ℤ)), (5242, (10000000000000000 : ℤ))], (0 : ℤ), (13349346377906950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_5HOXINDACTOX_fwd_pc
  ⟨[(5242, (-10000000000000000 : ℤ)), (5243, (10000000000000000 : ℤ))], (0 : ℤ), (54136333882847500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_5HOXINDACTOX_total_pc
  ⟨[(5243, (-10000000000000000 : ℤ))], (0 : ℤ), (54136333882847500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_5HOXINDACTOX_rev_pc
  ⟨[(5244, (-10000000000000000 : ℤ)), (5243, (10000000000000000 : ℤ))], (0 : ℤ), (0 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_GLACOx_fwd_cplx_HOMODIMER_ALDH3A2_pc
  ⟨[(3046, (-9819747365803660 : ℤ)), (5245, (10000000000000000 : ℤ))], (0 : ℤ), (40931629235877900000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_GLACOx_fwd_cplx_HOMOTETRAMER_ALDH9A1_pc
  ⟨[(3048, (-16276437512138200 : ℤ)), (5245, (10000000000000000 : ℤ))], (0 : ℤ), (13349346377906950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_GLACOx_fwd_pc
  ⟨[(5245, (-10000000000000000 : ℤ)), (5246, (10000000000000000 : ℤ))], (0 : ℤ), (54136333882847500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_GLACOx_total_pc
  ⟨[(5246, (-10000000000000000 : ℤ))], (0 : ℤ), (54136333882847500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_GLYALDD_fwd_cplx_HOMODIMER_ALDH3A2_pc
  ⟨[(3046, (-9819747365803660 : ℤ)), (5248, (10000000000000000 : ℤ))], (0 : ℤ), (40931629235877900000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_GLYALDD_fwd_cplx_HOMOTETRAMER_ALDH9A1_pc
  ⟨[(3048, (-16276437512138200 : ℤ)), (5248, (10000000000000000 : ℤ))], (0 : ℤ), (13349346377906950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_GLYALDD_fwd_pc
  ⟨[(5248, (-10000000000000000 : ℤ)), (5249, (10000000000000000 : ℤ))], (0 : ℤ), (54136333882847500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_GLYALDD_total_pc
  ⟨[(5249, (-10000000000000000 : ℤ))], (0 : ℤ), (54136333882847500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_GLYALDD_rev_pc
  ⟨[(5250, (-10000000000000000 : ℤ)), (5249, (10000000000000000 : ℤ))], (0 : ℤ), (54136333882847500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_IMACTD_fwd_cplx_HOMODIMER_ALDH3A2_pc
  ⟨[(3046, (-9819747365803660 : ℤ)), (5251, (10000000000000000 : ℤ))], (0 : ℤ), (40931629235877900000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_IMACTD_fwd_cplx_HOMOTETRAMER_ALDH9A1_pc
  ⟨[(3048, (-16276437512138200 : ℤ)), (5251, (10000000000000000 : ℤ))], (0 : ℤ), (13349346377906950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_IMACTD_fwd_pc
  ⟨[(5251, (-10000000000000000 : ℤ)), (5252, (10000000000000000 : ℤ))], (0 : ℤ), (54136333882847500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_IMACTD_total_pc
  ⟨[(5252, (-10000000000000000 : ℤ))], (0 : ℤ), (54136333882847500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_MMALNDHx_fwd_cplx_HOMODIMER_ALDH3A2_pc
  ⟨[(3046, (-9819747365803660 : ℤ)), (5254, (10000000000000000 : ℤ))], (0 : ℤ), (40931629235877900000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_MMALNDHx_fwd_cplx_HOMOTETRAMER_ALDH9A1_pc
  ⟨[(3048, (-16276437512138200 : ℤ)), (5254, (10000000000000000 : ℤ))], (0 : ℤ), (13349346377906950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_MMALNDHx_fwd_pc
  ⟨[(5254, (-10000000000000000 : ℤ)), (5255, (10000000000000000 : ℤ))], (0 : ℤ), (54136333882847500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_MMALNDHx_total_pc
  ⟨[(5255, (-10000000000000000 : ℤ))], (0 : ℤ), (54136333882847500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_MMALNDHx_rev_pc
  ⟨[(5256, (-10000000000000000 : ℤ)), (5255, (10000000000000000 : ℤ))], (0 : ℤ), (0 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_NABTNO_fwd_cplx_HOMODIMER_ALDH3A2_pc
  ⟨[(3046, (-9819747365803660 : ℤ)), (5257, (10000000000000000 : ℤ))], (0 : ℤ), (40931629235877900000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_NABTNO_fwd_cplx_HOMOTETRAMER_ALDH9A1_pc
  ⟨[(3048, (-16276437512138200 : ℤ)), (5257, (10000000000000000 : ℤ))], (0 : ℤ), (13349346377906950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_NABTNO_fwd_pc
  ⟨[(5257, (-10000000000000000 : ℤ)), (5258, (10000000000000000 : ℤ))], (0 : ℤ), (54136333882847500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_NABTNO_rev_pc
  ⟨[(5259, (-10000000000000000 : ℤ)), (5258, (10000000000000000 : ℤ))], (0 : ℤ), (0 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_TMABADH_fwd_cplx_HOMODIMER_ALDH3A2_pc
  ⟨[(3046, (-9819747365803660 : ℤ)), (5260, (10000000000000000 : ℤ))], (0 : ℤ), (40931629235877900000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_TMABADH_fwd_cplx_HOMOTETRAMER_ALDH9A1_pc
  ⟨[(3048, (-16276437512138200 : ℤ)), (5260, (10000000000000000 : ℤ))], (0 : ℤ), (13349346377906950000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_TMABADH_fwd_pc
  ⟨[(5260, (-10000000000000000 : ℤ)), (5261, (10000000000000000 : ℤ))], (0 : ℤ), (54136333882847500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_TMABADH_total_pc
  ⟨[(5261, (-10000000000000000 : ℤ))], (0 : ℤ), (54136333882847500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_TMABADH_rev_pc
  ⟨[(5262, (-10000000000000000 : ℤ)), (5261, (10000000000000000 : ℤ))], (0 : ℤ), (0 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_HXDCAL2EDHx_fwd_cplx_HOMODIMER_ALDH3A2_pc
  ⟨[(3046, (-9819747365803660 : ℤ)), (5263, (10000000000000000 : ℤ))], (0 : ℤ), (40931629235877900000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_HXDCAL2EDHx_fwd_cplx_MONOMER_ALDH3B1_pc
  ⟨[(3047, (-5596926666141710 : ℤ)), (5263, (10000000000000000 : ℤ))], (0 : ℤ), (151965146815627500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_HXDCAL2EDHx_fwd_pc
  ⟨[(5263, (-10000000000000000 : ℤ)), (5264, (10000000000000000 : ℤ))], (0 : ℤ), (192896776051505500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_HXDCAL2EDHx_rev_pc
  ⟨[(5265, (-10000000000000000 : ℤ)), (5264, (10000000000000000 : ℤ))], (0 : ℤ), (115834555574194500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_HXDCAL2EDHy_fwd_cplx_HOMODIMER_ALDH3A2_pc
  ⟨[(3046, (-9819747365803660 : ℤ)), (5266, (10000000000000000 : ℤ))], (0 : ℤ), (40931629235877900000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_HXDCAL2EDHy_fwd_cplx_MONOMER_ALDH3B1_pc
  ⟨[(3047, (-5596926666141710 : ℤ)), (5266, (10000000000000000 : ℤ))], (0 : ℤ), (151965146815627500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_HXDCAL2EDHy_fwd_pc
  ⟨[(5266, (-10000000000000000 : ℤ)), (5267, (10000000000000000 : ℤ))], (0 : ℤ), (192896776051505500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_HXDCAL2EDHy_total_pc
  ⟨[(5267, (-10000000000000000 : ℤ))], (0 : ℤ), (192896776051505500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_HXDCAL2EDHy_rev_pc
  ⟨[(5268, (-10000000000000000 : ℤ)), (5267, (10000000000000000 : ℤ))], (0 : ℤ), (115834555574194500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_HXDCALDHx_fwd_cplx_HOMODIMER_ALDH3A2_pc
  ⟨[(3046, (-9819747365803660 : ℤ)), (5269, (10000000000000000 : ℤ))], (0 : ℤ), (40931629235877900000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_HXDCALDHx_fwd_cplx_MONOMER_ALDH3B1_pc
  ⟨[(3047, (-5596926666141710 : ℤ)), (5269, (10000000000000000 : ℤ))], (0 : ℤ), (151965146815627500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_HXDCALDHx_fwd_pc
  ⟨[(5269, (-10000000000000000 : ℤ)), (5270, (10000000000000000 : ℤ))], (0 : ℤ), (192896776051505500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_HXDCALDHx_rev_pc
  ⟨[(5271, (-10000000000000000 : ℤ)), (5270, (10000000000000000 : ℤ))], (0 : ℤ), (38611518524731450000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_HXDCALDHy_fwd_cplx_HOMODIMER_ALDH3A2_pc
  ⟨[(3046, (-9819747365803660 : ℤ)), (5272, (10000000000000000 : ℤ))], (0 : ℤ), (40931629235877900000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_HXDCALDHy_fwd_cplx_MONOMER_ALDH3B1_pc
  ⟨[(3047, (-5596926666141710 : ℤ)), (5272, (10000000000000000 : ℤ))], (0 : ℤ), (151965146815627500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_HXDCALDHy_fwd_pc
  ⟨[(5272, (-10000000000000000 : ℤ)), (5273, (10000000000000000 : ℤ))], (0 : ℤ), (192896776051505500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_HXDCALDHy_total_pc
  ⟨[(5273, (-10000000000000000 : ℤ))], (0 : ℤ), (192896776051505500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_HXDCALDHy_rev_pc
  ⟨[(5274, (-10000000000000000 : ℤ)), (5273, (10000000000000000 : ℤ))], (0 : ℤ), (38611518524731450000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BAMPPALDOXx_fwd_cplx_HOMODIMER_ALDH3A2_pc
  ⟨[(3046, (-9819747365803660 : ℤ)), (5275, (10000000000000000 : ℤ))], (0 : ℤ), (40931629235877900000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_BAMPPALDOXx_fwd_cplx_MONOMER_ALDH3B1_pc
  ⟨[(3047, (-5596926666141710 : ℤ)), (5275, (10000000000000000 : ℤ))], (0 : ℤ), (151965146815627500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_BAMPPALDOXx_fwd_pc
  ⟨[(5275, (-10000000000000000 : ℤ)), (5276, (10000000000000000 : ℤ))], (0 : ℤ), (206083049059061500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_BAMPPALDOXx_total_pc
  ⟨[(5276, (-10000000000000000 : ℤ))], (0 : ℤ), (206083049059061500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_BAMPPALDOXx_rev_pc
  ⟨[(5277, (-10000000000000000 : ℤ)), (5276, (10000000000000000 : ℤ))], (0 : ℤ), (2322964715961035000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_AHDTPPPH_fwd_cplx_HOMODIMER_ALPL_pc
  ⟨[(3052, (-10146370542427700 : ℤ)), (5278, (10000000000000000 : ℤ))], (0 : ℤ), (37922889682578800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_AHDTPPPH_fwd_pc
  ⟨[(5278, (-10000000000000000 : ℤ)), (5279, (10000000000000000 : ℤ))], (0 : ℤ), (37922889682578800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_AHDTPPPH_total_pc
  ⟨[(5279, (-10000000000000000 : ℤ))], (0 : ℤ), (37922889682578800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_AHDTPPPH_rev_pc
  ⟨[(5280, (-10000000000000000 : ℤ)), (5279, (10000000000000000 : ℤ))], (0 : ℤ), (1997030326679415000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩
]
theorem chunk156_cost : (chunk156.map cost).sum = (0 : ℤ) := by
  decide +kernel
def chunk157 : List Column := [
  -- R_ENZFM_enzyme_ALKP_fwd_cplx_HOMODIMER_ALPL_pc
  ⟨[(3052, (-10146370542427700 : ℤ)), (5281, (10000000000000000 : ℤ))], (0 : ℤ), (37922889682578800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_ALKP_fwd_pc
  ⟨[(5281, (-10000000000000000 : ℤ)), (5282, (10000000000000000 : ℤ))], (0 : ℤ), (37922889682578800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_ALKP_rev_pc
  ⟨[(5283, (-10000000000000000 : ℤ)), (5282, (10000000000000000 : ℤ))], (0 : ℤ), (37922889682578800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_CRTNP_fwd_cplx_HOMODIMER_ALPL_pc
  ⟨[(3052, (-10146370542427700 : ℤ)), (5284, (10000000000000000 : ℤ))], (0 : ℤ), (37922889682578800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_CRTNP_fwd_pc
  ⟨[(5284, (-10000000000000000 : ℤ)), (5285, (10000000000000000 : ℤ))], (0 : ℤ), (37922889682578800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_CRTNP_total_pc
  ⟨[(5285, (-10000000000000000 : ℤ))], (0 : ℤ), (37922889682578800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_CRTNP_rev_pc
  ⟨[(5286, (-10000000000000000 : ℤ)), (5285, (10000000000000000 : ℤ))], (0 : ℤ), (37922889682578800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_CRTNPe_fwd_cplx_HOMODIMER_ALPL_pc
  ⟨[(3052, (-10146370542427700 : ℤ)), (5287, (10000000000000000 : ℤ))], (0 : ℤ), (37922889682578800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_CRTNPe_fwd_pc
  ⟨[(5287, (-10000000000000000 : ℤ)), (5288, (10000000000000000 : ℤ))], (0 : ℤ), (37922889682578800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_CRTNPe_total_pc
  ⟨[(5288, (-10000000000000000 : ℤ))], (0 : ℤ), (37922889682578800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_CRTNPe_rev_pc
  ⟨[(5289, (-10000000000000000 : ℤ)), (5288, (10000000000000000 : ℤ))], (0 : ℤ), (37922889682578800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_NTDAMPe_fwd_pc
  ⟨[(5290, (-10000000000000000 : ℤ)), (5291, (10000000000000000 : ℤ))], (0 : ℤ), (37922889682578800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_NTDAMPe_total_pc
  ⟨[(5291, (-10000000000000000 : ℤ))], (0 : ℤ), (37922889682578800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_NTDAMPe_rev_pc
  ⟨[(5292, (-10000000000000000 : ℤ)), (5291, (10000000000000000 : ℤ))], (0 : ℤ), (37922889682578800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PPAe_fwd_cplx_HOMODIMER_ALPL_pc
  ⟨[(3052, (-10146370542427700 : ℤ)), (5293, (10000000000000000 : ℤ))], (0 : ℤ), (37922889682578800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PPAe_fwd_pc
  ⟨[(5293, (-10000000000000000 : ℤ)), (5294, (10000000000000000 : ℤ))], (0 : ℤ), (37922889682578800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PPAe_total_pc
  ⟨[(5294, (-10000000000000000 : ℤ))], (0 : ℤ), (37922889682578800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PPAe_rev_pc
  ⟨[(5295, (-10000000000000000 : ℤ)), (5294, (10000000000000000 : ℤ))], (0 : ℤ), (37922889682578800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PYDXPPe_fwd_cplx_HOMODIMER_ALPL_pc
  ⟨[(3052, (-10146370542427700 : ℤ)), (5296, (10000000000000000 : ℤ))], (0 : ℤ), (37922889682578800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PYDXPPe_total_pc
  ⟨[(5297, (-10000000000000000 : ℤ))], (0 : ℤ), (37922889682578800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PYDXPPe_rev_pc
  ⟨[(5298, (-10000000000000000 : ℤ)), (5297, (10000000000000000 : ℤ))], (0 : ℤ), (37922889682578800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_THMMPPe_fwd_cplx_HOMODIMER_ALPL_pc
  ⟨[(3052, (-10146370542427700 : ℤ)), (5299, (10000000000000000 : ℤ))], (0 : ℤ), (37922889682578800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_THMMPPe_fwd_pc
  ⟨[(5299, (-10000000000000000 : ℤ)), (5300, (10000000000000000 : ℤ))], (0 : ℤ), (37922889682578800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_THMMPPe_total_pc
  ⟨[(5300, (-10000000000000000 : ℤ))], (0 : ℤ), (37922889682578800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_THMMPPe_rev_pc
  ⟨[(5301, (-10000000000000000 : ℤ)), (5300, (10000000000000000 : ℤ))], (0 : ℤ), (37922889682578800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_NDPADPe_fwd_cplx_HOMODIMER_ALPL_pc
  ⟨[(3052, (-10146370542427700 : ℤ)), (5302, (10000000000000000 : ℤ))], (0 : ℤ), (37922889682578800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_NDPADPe_fwd_cplx_HOMODIMER_ENTPD1_pc
  ⟨[(3230, (-10234125517509700 : ℤ)), (5302, (10000000000000000 : ℤ))], (0 : ℤ), (37168472044568200000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_NDPADPe_fwd_pc
  ⟨[(5302, (-10000000000000000 : ℤ)), (5303, (10000000000000000 : ℤ))], (0 : ℤ), (75091361727147000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_NDPADPe_rev_pc
  ⟨[(5304, (-10000000000000000 : ℤ)), (5303, (10000000000000000 : ℤ))], (0 : ℤ), (75091361727147000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_NTPAe_fwd_cplx_HOMODIMER_ALPL_pc
  ⟨[(3052, (-10146370542427700 : ℤ)), (5305, (10000000000000000 : ℤ))], (0 : ℤ), (37922889682578800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_NTPAe_fwd_cplx_HOMODIMER_ENTPD1_pc
  ⟨[(3230, (-10234125517509700 : ℤ)), (5305, (10000000000000000 : ℤ))], (0 : ℤ), (37168472044568200000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_NTPAe_fwd_pc
  ⟨[(5305, (-10000000000000000 : ℤ)), (5306, (10000000000000000 : ℤ))], (0 : ℤ), (75091361727147000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_NTPAe_total_pc
  ⟨[(5306, (-10000000000000000 : ℤ))], (0 : ℤ), (75091361727147000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_NTPAe_rev_pc
  ⟨[(5307, (-10000000000000000 : ℤ)), (5306, (10000000000000000 : ℤ))], (0 : ℤ), (75091361727147000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ETHPe_fwd_cplx_HOMODIMER_ALPL_pc
  ⟨[(3052, (-10146370542427700 : ℤ)), (5308, (10000000000000000 : ℤ))], (0 : ℤ), (37922889682578800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_ETHPe_fwd_cplx_MONOMER_PHOSPHO1_pc
  ⟨[(3542, (-3686940081342020 : ℤ)), (5308, (10000000000000000 : ℤ))], (0 : ℤ), (404361352085245000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_ETHPe_fwd_pc
  ⟨[(5308, (-10000000000000000 : ℤ)), (5309, (10000000000000000 : ℤ))], (0 : ℤ), (442197235507850000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_ETHPe_rev_pc
  ⟨[(5310, (-10000000000000000 : ℤ)), (5309, (10000000000000000 : ℤ))], (0 : ℤ), (442197235507850000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LPCSCRt_fwd_cplx_HOMODIMER_ANO6_pc
  ⟨[(3056, (-16114392505375400 : ℤ)), (5311, (10000000000000000 : ℤ))], (0 : ℤ), (12886270533106850000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LPCSCRt_fwd_cplx_MONOMER_PLSCR1_pc
  ⟨[(3566, (-4171975171276550 : ℤ)), (5311, (10000000000000000 : ℤ))], (0 : ℤ), (306605526684857000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LPCSCRt_fwd_cplx_MONOMER_PLSCR4_pc
  ⟨[(3567, (-4345941742529270 : ℤ)), (5311, (10000000000000000 : ℤ))], (0 : ℤ), (484702893572149500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_LPCSCRt_fwd_pc
  ⟨[(5311, (-10000000000000000 : ℤ)), (5312, (10000000000000000 : ℤ))], (0 : ℤ), (799712650883695000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_LPCSCRt_total_pc
  ⟨[(5312, (-10000000000000000 : ℤ))], (0 : ℤ), (799712650883695000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LPCSCRt_rev_cplx_HOMODIMER_ANO6_pc
  ⟨[(3056, (-16114392505375400 : ℤ)), (5313, (10000000000000000 : ℤ))], (0 : ℤ), (12886270533106850000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LPCSCRt_rev_cplx_MONOMER_PLSCR1_pc
  ⟨[(3566, (-4171975171276550 : ℤ)), (5313, (10000000000000000 : ℤ))], (0 : ℤ), (306605526684857000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LPCSCRt_rev_cplx_MONOMER_PLSCR4_pc
  ⟨[(3567, (-4345941742529270 : ℤ)), (5313, (10000000000000000 : ℤ))], (0 : ℤ), (484702893572149500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PCSCRt_fwd_cplx_HOMODIMER_ANO6_pc
  ⟨[(3056, (-16114392505375400 : ℤ)), (5314, (10000000000000000 : ℤ))], (0 : ℤ), (12886270533106850000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PCSCRt_fwd_cplx_MONOMER_PLSCR1_pc
  ⟨[(3566, (-4171975171276550 : ℤ)), (5314, (10000000000000000 : ℤ))], (0 : ℤ), (306605526684857000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PCSCRt_fwd_cplx_MONOMER_PLSCR4_pc
  ⟨[(3567, (-4345941742529270 : ℤ)), (5314, (10000000000000000 : ℤ))], (0 : ℤ), (484702893572149500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PCSCRt_fwd_pc
  ⟨[(5314, (-10000000000000000 : ℤ)), (5315, (10000000000000000 : ℤ))], (0 : ℤ), (799712650883695000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PCSCRt_total_pc
  ⟨[(5315, (-10000000000000000 : ℤ))], (0 : ℤ), (799712650883695000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PCSCRt_rev_cplx_HOMODIMER_ANO6_pc
  ⟨[(3056, (-16114392505375400 : ℤ)), (5316, (10000000000000000 : ℤ))], (0 : ℤ), (12886270533106850000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PCSCRt_rev_cplx_MONOMER_PLSCR1_pc
  ⟨[(3566, (-4171975171276550 : ℤ)), (5316, (10000000000000000 : ℤ))], (0 : ℤ), (306605526684857000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PCSCRt_rev_cplx_MONOMER_PLSCR4_pc
  ⟨[(3567, (-4345941742529270 : ℤ)), (5316, (10000000000000000 : ℤ))], (0 : ℤ), (484702893572149500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PSSCRt_fwd_cplx_HOMODIMER_ANO6_pc
  ⟨[(3056, (-16114392505375400 : ℤ)), (5317, (10000000000000000 : ℤ))], (0 : ℤ), (12886270533106850000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PSSCRt_fwd_cplx_MONOMER_PLSCR1_pc
  ⟨[(3566, (-4171975171276550 : ℤ)), (5317, (10000000000000000 : ℤ))], (0 : ℤ), (306605526684857000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PSSCRt_fwd_cplx_MONOMER_PLSCR4_pc
  ⟨[(3567, (-4345941742529270 : ℤ)), (5317, (10000000000000000 : ℤ))], (0 : ℤ), (484702893572149500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PSSCRt_fwd_pc
  ⟨[(5317, (-10000000000000000 : ℤ)), (5318, (10000000000000000 : ℤ))], (0 : ℤ), (799712650883695000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PSSCRt_total_pc
  ⟨[(5318, (-10000000000000000 : ℤ))], (0 : ℤ), (799712650883695000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PSSCRt_rev_cplx_HOMODIMER_ANO6_pc
  ⟨[(3056, (-16114392505375400 : ℤ)), (5319, (10000000000000000 : ℤ))], (0 : ℤ), (12886270533106850000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PSSCRt_rev_cplx_MONOMER_PLSCR1_pc
  ⟨[(3566, (-4171975171276550 : ℤ)), (5319, (10000000000000000 : ℤ))], (0 : ℤ), (306605526684857000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PSSCRt_rev_cplx_MONOMER_PLSCR4_pc
  ⟨[(3567, (-4345941742529270 : ℤ)), (5319, (10000000000000000 : ℤ))], (0 : ℤ), (484702893572149500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PSSCRt_rev_pc
  ⟨[(5319, (-10000000000000000 : ℤ)), (5318, (10000000000000000 : ℤ))], (0 : ℤ), (799712650883695000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_ADPT_fwd_pc
  ⟨[(5320, (-10000000000000000 : ℤ)), (5321, (10000000000000000 : ℤ))], (0 : ℤ), (274929134577184500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩
]
theorem chunk157_cost : (chunk157.map cost).sum = (0 : ℤ) := by
  decide +kernel
def chunk158 : List Column := [
  -- R_ENZDL_enzyme_ADPT_total_pc
  ⟨[(5321, (-10000000000000000 : ℤ))], (0 : ℤ), (274929134577184500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_ADPT_rev_pc
  ⟨[(5322, (-10000000000000000 : ℤ)), (5321, (10000000000000000 : ℤ))], (0 : ℤ), (33467770904313000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_AICRT_fwd_cplx_HOMODIMER_APRT_pc
  ⟨[(3059, (-4539481655743030 : ℤ)), (5323, (10000000000000000 : ℤ))], (0 : ℤ), (274929134577184500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_AICRT_fwd_pc
  ⟨[(5323, (-10000000000000000 : ℤ)), (5324, (10000000000000000 : ℤ))], (0 : ℤ), (274929134577184500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_AICRT_total_pc
  ⟨[(5324, (-10000000000000000 : ℤ))], (0 : ℤ), (274929134577184500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_AICRT_rev_pc
  ⟨[(5325, (-10000000000000000 : ℤ)), (5324, (10000000000000000 : ℤ))], (0 : ℤ), (55827165075466000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_AICART_fwd_cplx_HOMODIMER_ATIC_pc
  ⟨[(3069, (-11103190109542000 : ℤ)), (5326, (10000000000000000 : ℤ))], (0 : ℤ), (33682619053189700000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_AICART_fwd_pc
  ⟨[(5326, (-10000000000000000 : ℤ)), (5327, (10000000000000000 : ℤ))], (0 : ℤ), (33682619053189700000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_AICART_rev_pc
  ⟨[(5328, (-10000000000000000 : ℤ)), (5327, (10000000000000000 : ℤ))], (0 : ℤ), (14791329800643250000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_IMPC_fwd_cplx_HOMODIMER_ATIC_pc
  ⟨[(3069, (-11103190109542000 : ℤ)), (5329, (10000000000000000 : ℤ))], (0 : ℤ), (33682619053189700000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_IMPC_fwd_pc
  ⟨[(5329, (-10000000000000000 : ℤ)), (5330, (10000000000000000 : ℤ))], (0 : ℤ), (33682619053189700000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_IMPC_total_pc
  ⟨[(5330, (-10000000000000000 : ℤ))], (0 : ℤ), (33682619053189700000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_IMPC_rev_cplx_HOMODIMER_ATIC_pc
  ⟨[(3069, (-11103190109542000 : ℤ)), (5331, (10000000000000000 : ℤ))], (0 : ℤ), (33682619053189700000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_IMPC_rev_pc
  ⟨[(5331, (-10000000000000000 : ℤ)), (5330, (10000000000000000 : ℤ))], (0 : ℤ), (33682619053189700000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DPGase_fwd_cplx_HOMODIMER_BPGM_pc
  ⟨[(3092, (-6245575331499440 : ℤ)), (5332, (10000000000000000 : ℤ))], (0 : ℤ), (146938991565216500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_DPGase_fwd_pc
  ⟨[(5332, (-10000000000000000 : ℤ)), (5333, (10000000000000000 : ℤ))], (0 : ℤ), (146938991565216500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_DPGase_rev_pc
  ⟨[(5334, (-10000000000000000 : ℤ)), (5333, (10000000000000000 : ℤ))], (0 : ℤ), (115834555574194500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DPGM_fwd_cplx_HOMODIMER_BPGM_pc
  ⟨[(3092, (-6245575331499440 : ℤ)), (5335, (10000000000000000 : ℤ))], (0 : ℤ), (146938991565216500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DPGM_fwd_cplx_HOMODIMER_PGAM1_pc
  ⟨[(3531, (-6057537593768140 : ℤ)), (5335, (10000000000000000 : ℤ))], (0 : ℤ), (137447767767585500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_DPGM_fwd_pc
  ⟨[(5335, (-10000000000000000 : ℤ)), (5336, (10000000000000000 : ℤ))], (0 : ℤ), (277433634187104000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_DPGM_total_pc
  ⟨[(5336, (-10000000000000000 : ℤ))], (0 : ℤ), (277433634187104000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DPGM_rev_cplx_HOMODIMER_BPGM_pc
  ⟨[(3092, (-6245575331499440 : ℤ)), (5337, (10000000000000000 : ℤ))], (0 : ℤ), (146938991565216500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DPGM_rev_cplx_HOMODIMER_PGAM1_pc
  ⟨[(3531, (-6057537593768140 : ℤ)), (5337, (10000000000000000 : ℤ))], (0 : ℤ), (137447767767585500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_DPGM_rev_pc
  ⟨[(5337, (-10000000000000000 : ℤ)), (5336, (10000000000000000 : ℤ))], (0 : ℤ), (277433634187104000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PGM_fwd_cplx_HOMODIMER_BPGM_pc
  ⟨[(3092, (-6245575331499440 : ℤ)), (5338, (10000000000000000 : ℤ))], (0 : ℤ), (146938991565216500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PGM_fwd_pc
  ⟨[(5338, (-10000000000000000 : ℤ)), (5339, (10000000000000000 : ℤ))], (0 : ℤ), (277433634187104000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PGM_total_pc
  ⟨[(5339, (-10000000000000000 : ℤ))], (0 : ℤ), (277433634187104000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PGM_rev_cplx_HOMODIMER_BPGM_pc
  ⟨[(3092, (-6245575331499440 : ℤ)), (5340, (10000000000000000 : ℤ))], (0 : ℤ), (146938991565216500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PGM_rev_cplx_HOMODIMER_PGAM1_pc
  ⟨[(3531, (-6057537593768140 : ℤ)), (5340, (10000000000000000 : ℤ))], (0 : ℤ), (137447767767585500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PGM_rev_pc
  ⟨[(5340, (-10000000000000000 : ℤ)), (5339, (10000000000000000 : ℤ))], (0 : ℤ), (277433634187104000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PRMTSDMA_fwd_cplx_HOMODIMER_CARM1_pc
  ⟨[(3106, (-11262094433380600 : ℤ)), (5341, (10000000000000000 : ℤ))], (0 : ℤ), (30484033355564200000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PRMTSDMA_fwd_cplx_COMPLEX_PRMT5_WDR77_CLNS1A_pc
  ⟨[(3137, (-32551300963583100 : ℤ)), (5341, (10000000000000000 : ℤ))], (0 : ℤ), (4897858807587055000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PRMTSDMA_fwd_pc
  ⟨[(5341, (-10000000000000000 : ℤ)), (5342, (10000000000000000 : ℤ))], (0 : ℤ), (35225942823090400000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PRMTSDMA_total_pc
  ⟨[(5342, (-10000000000000000 : ℤ))], (0 : ℤ), (35225942823090400000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PRMTMMA_fwd_cplx_HOMODIMER_CARM1_pc
  ⟨[(3106, (-11262094433380600 : ℤ)), (5344, (10000000000000000 : ℤ))], (0 : ℤ), (30484033355564200000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PRMTMMA_fwd_cplx_COMPLEX_PRMT5_WDR77_CLNS1A_pc
  ⟨[(3137, (-32551300963583100 : ℤ)), (5344, (10000000000000000 : ℤ))], (0 : ℤ), (4897858807587055000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_PRMTMMA_fwd_cplx_HOMOOCTOMER_PRMT1_pc
  ⟨[(3651, (-22916772986675500 : ℤ)), (5344, (10000000000000000 : ℤ))], (0 : ℤ), (5787090575730450000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PRMTMMA_fwd_pc
  ⟨[(5344, (-10000000000000000 : ℤ)), (5345, (10000000000000000 : ℤ))], (0 : ℤ), (40863578083937050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PRMTMMA_total_pc
  ⟨[(5345, (-10000000000000000 : ℤ))], (0 : ℤ), (40863578083937050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_PRMTMMA_rev_pc
  ⟨[(5346, (-10000000000000000 : ℤ)), (5345, (10000000000000000 : ℤ))], (0 : ℤ), (20431789041968550000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_CYSTRS_fwd_cplx_HOMODIMER_CARS1_pc
  ⟨[(3107, (-13695092816334400 : ℤ)), (5347, (10000000000000000 : ℤ))], (71819026577449500000 : ℤ), (19186925924401500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_CYSTRS_fwd_pc
  ⟨[(5347, (-10000000000000000 : ℤ)), (5348, (10000000000000000 : ℤ))], (71819026577449500000 : ℤ), (19186925924401500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_CYSTRS_rev_pc
  ⟨[(5349, (-10000000000000000 : ℤ)), (5348, (10000000000000000 : ℤ))], (0 : ℤ), (0 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_CADPRBPH_fwd_cplx_HOMODIMER_CD38_pc
  ⟨[(3112, (-6910011245834230 : ℤ)), (5350, (10000000000000000 : ℤ))], (0 : ℤ), (92934294478436000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_CADPRBPH_fwd_pc
  ⟨[(5350, (-10000000000000000 : ℤ)), (5351, (10000000000000000 : ℤ))], (0 : ℤ), (92934294478436000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_CADPRBPH_total_pc
  ⟨[(5351, (-10000000000000000 : ℤ))], (0 : ℤ), (92934294478436000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_CADPRBPH_rev_pc
  ⟨[(5352, (-10000000000000000 : ℤ)), (5351, (10000000000000000 : ℤ))], (0 : ℤ), (0 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_CADPRIBH_fwd_cplx_HOMODIMER_CD38_pc
  ⟨[(3112, (-6910011245834230 : ℤ)), (5353, (10000000000000000 : ℤ))], (0 : ℤ), (92934294478436000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_CADPRIBH_fwd_pc
  ⟨[(5353, (-10000000000000000 : ℤ)), (5354, (10000000000000000 : ℤ))], (0 : ℤ), (92934294478436000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_CADPRIBH_total_pc
  ⟨[(5354, (-10000000000000000 : ℤ))], (0 : ℤ), (92934294478436000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_CADPRIBH_rev_pc
  ⟨[(5355, (-10000000000000000 : ℤ)), (5354, (10000000000000000 : ℤ))], (0 : ℤ), (46467147239218050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_CADPRIBtec_fwd_pc
  ⟨[(5356, (-10000000000000000 : ℤ)), (5357, (10000000000000000 : ℤ))], (0 : ℤ), (92934294478436000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_CADPRIBtec_total_pc
  ⟨[(5357, (-10000000000000000 : ℤ))], (0 : ℤ), (92934294478436000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_CADPRIBtec_rev_pc
  ⟨[(5358, (-10000000000000000 : ℤ)), (5357, (10000000000000000 : ℤ))], (0 : ℤ), (46467147239218050000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DNADPL_fwd_cplx_HOMODIMER_CD38_pc
  ⟨[(3112, (-6910011245834230 : ℤ)), (5359, (10000000000000000 : ℤ))], (0 : ℤ), (92934294478436000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_DNADPL_fwd_pc
  ⟨[(5359, (-10000000000000000 : ℤ)), (5360, (10000000000000000 : ℤ))], (0 : ℤ), (92934294478436000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_DNADPL_total_pc
  ⟨[(5360, (-10000000000000000 : ℤ))], (0 : ℤ), (92934294478436000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_DNADPL_rev_cplx_HOMODIMER_CD38_pc
  ⟨[(3112, (-6910011245834230 : ℤ)), (5361, (10000000000000000 : ℤ))], (0 : ℤ), (92934294478436000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_DNADPL_rev_pc
  ⟨[(5361, (-10000000000000000 : ℤ)), (5360, (10000000000000000 : ℤ))], (0 : ℤ), (92934294478436000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_NADL_fwd_cplx_HOMODIMER_CD38_pc
  ⟨[(3112, (-6910011245834230 : ℤ)), (5362, (10000000000000000 : ℤ))], (0 : ℤ), (92934294478436000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_NADL_total_pc
  ⟨[(5363, (-10000000000000000 : ℤ))], (0 : ℤ), (92934294478436000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_NADL_rev_cplx_HOMODIMER_CD38_pc
  ⟨[(3112, (-6910011245834230 : ℤ)), (5364, (10000000000000000 : ℤ))], (0 : ℤ), (92934294478436000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_NADL_rev_pc
  ⟨[(5364, (-10000000000000000 : ℤ)), (5363, (10000000000000000 : ℤ))], (0 : ℤ), (92934294478436000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_NADN_fwd_cplx_HOMODIMER_CD38_pc
  ⟨[(3112, (-6910011245834230 : ℤ)), (5365, (10000000000000000 : ℤ))], (0 : ℤ), (92934294478436000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩
]
theorem chunk158_cost : (chunk158.map cost).sum = (0 : ℤ) := by
  decide +kernel
def chunk159 : List Column := [
  -- R_ENZDL_enzyme_NADN_fwd_pc
  ⟨[(5365, (-10000000000000000 : ℤ)), (5366, (10000000000000000 : ℤ))], (0 : ℤ), (92934294478436000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_NADN_total_pc
  ⟨[(5366, (-10000000000000000 : ℤ))], (0 : ℤ), (92934294478436000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_NADN_rev_pc
  ⟨[(5367, (-10000000000000000 : ℤ)), (5366, (10000000000000000 : ℤ))], (0 : ℤ), (51476076918021000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_NADPL_fwd_cplx_HOMODIMER_CD38_pc
  ⟨[(3112, (-6910011245834230 : ℤ)), (5368, (10000000000000000 : ℤ))], (0 : ℤ), (92934294478436000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_NADPL_fwd_pc
  ⟨[(5368, (-10000000000000000 : ℤ)), (5369, (10000000000000000 : ℤ))], (0 : ℤ), (92934294478436000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_NADPL_rev_cplx_HOMODIMER_CD38_pc
  ⟨[(3112, (-6910011245834230 : ℤ)), (5370, (10000000000000000 : ℤ))], (0 : ℤ), (92934294478436000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_NADPL_rev_pc
  ⟨[(5370, (-10000000000000000 : ℤ)), (5369, (10000000000000000 : ℤ))], (0 : ℤ), (92934294478436000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_NADPN_fwd_cplx_HOMODIMER_CD38_pc
  ⟨[(3112, (-6910011245834230 : ℤ)), (5371, (10000000000000000 : ℤ))], (0 : ℤ), (92934294478436000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_NADPN_fwd_pc
  ⟨[(5371, (-10000000000000000 : ℤ)), (5372, (10000000000000000 : ℤ))], (0 : ℤ), (92934294478436000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_NADPN_total_pc
  ⟨[(5372, (-10000000000000000 : ℤ))], (0 : ℤ), (92934294478436000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_NADPN_rev_pc
  ⟨[(5373, (-10000000000000000 : ℤ)), (5372, (10000000000000000 : ℤ))], (0 : ℤ), (0 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_NMNN_fwd_cplx_HOMODIMER_CD38_pc
  ⟨[(3112, (-6910011245834230 : ℤ)), (5374, (10000000000000000 : ℤ))], (0 : ℤ), (92934294478436000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_NMNN_fwd_pc
  ⟨[(5374, (-10000000000000000 : ℤ)), (5375, (10000000000000000 : ℤ))], (0 : ℤ), (92934294478436000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_NMNN_rev_pc
  ⟨[(5376, (-10000000000000000 : ℤ)), (5375, (10000000000000000 : ℤ))], (0 : ℤ), (40634435918864200000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_CDS_fwd_cplx_HOMODIMER_CDS2_pc
  ⟨[(3122, (-9354964758999920 : ℤ)), (5377, (10000000000000000 : ℤ))], (0 : ℤ), (45834736165825300000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_CDS_fwd_pc
  ⟨[(5377, (-10000000000000000 : ℤ)), (5378, (10000000000000000 : ℤ))], (0 : ℤ), (45834736165825300000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_CDS_total_pc
  ⟨[(5378, (-10000000000000000 : ℤ))], (0 : ℤ), (45834736165825300000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_CDS_rev_pc
  ⟨[(5379, (-10000000000000000 : ℤ)), (5378, (10000000000000000 : ℤ))], (0 : ℤ), (39382974553685450000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_CK_fwd_cplx_HOMODIMER_CKB_pc
  ⟨[(3125, (-8128287143457580 : ℤ)), (5380, (10000000000000000 : ℤ))], (0 : ℤ), (63625129461101000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_CK_fwd_cplx_HETERODIMER_CK_pc
  ⟨[(3126, (-8161865968352500 : ℤ)), (5380, (10000000000000000 : ℤ))], (0 : ℤ), (125344951545468500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_CK_fwd_cplx_HOMODIMER_CKM_pc
  ⟨[(3127, (-8195398807102450 : ℤ)), (5380, (10000000000000000 : ℤ))], (0 : ℤ), (62416040903167500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_CK_fwd_pc
  ⟨[(5380, (-10000000000000000 : ℤ)), (5381, (10000000000000000 : ℤ))], (0 : ℤ), (126041170364268500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_CK_rev_pc
  ⟨[(5382, (-10000000000000000 : ℤ)), (5381, (10000000000000000 : ℤ))], (0 : ℤ), (37922889682578800000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_CKe_fwd_cplx_HOMODIMER_CKB_pc
  ⟨[(3125, (-8128287143457580 : ℤ)), (5383, (10000000000000000 : ℤ))], (0 : ℤ), (63625129461101000000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_CKe_fwd_cplx_HETERODIMER_CK_pc
  ⟨[(3126, (-8161865968352500 : ℤ)), (5383, (10000000000000000 : ℤ))], (0 : ℤ), (125344951545468500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_CKe_fwd_cplx_HOMODIMER_CKM_pc
  ⟨[(3127, (-8195398807102450 : ℤ)), (5383, (10000000000000000 : ℤ))], (0 : ℤ), (62416040903167500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_CKe_fwd_pc
  ⟨[(5383, (-10000000000000000 : ℤ)), (5384, (10000000000000000 : ℤ))], (0 : ℤ), (126041170364268500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_CKe_total_pc
  ⟨[(5384, (-10000000000000000 : ℤ))], (0 : ℤ), (126041170364268500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_CKe_rev_pc
  ⟨[(5385, (-10000000000000000 : ℤ)), (5384, (10000000000000000 : ℤ))], (0 : ℤ), (126041170364268500000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_GFDPP_fwd_cplx_HOMODIMER_CNDP2_pc
  ⟨[(3140, (-9552338944849730 : ℤ)), (5386, (10000000000000000 : ℤ))], (0 : ℤ), (45065873370163300000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_GFDPP_fwd_pc
  ⟨[(5386, (-10000000000000000 : ℤ)), (5387, (10000000000000000 : ℤ))], (0 : ℤ), (45065873370163300000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_GFDPP_rev_pc
  ⟨[(5388, (-10000000000000000 : ℤ)), (5387, (10000000000000000 : ℤ))], (0 : ℤ), (0 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_GGDPP_fwd_cplx_HOMODIMER_CNDP2_pc
  ⟨[(3140, (-9552338944849730 : ℤ)), (5389, (10000000000000000 : ℤ))], (0 : ℤ), (45065873370163300000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_GGDPP_fwd_pc
  ⟨[(5389, (-10000000000000000 : ℤ)), (5390, (10000000000000000 : ℤ))], (0 : ℤ), (45065873370163300000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_GGDPP_total_pc
  ⟨[(5390, (-10000000000000000 : ℤ))], (0 : ℤ), (45065873370163300000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_GGDPP_rev_pc
  ⟨[(5391, (-10000000000000000 : ℤ)), (5390, (10000000000000000 : ℤ))], (0 : ℤ), (0 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_GLDPP_fwd_cplx_HOMODIMER_CNDP2_pc
  ⟨[(3140, (-9552338944849730 : ℤ)), (5392, (10000000000000000 : ℤ))], (0 : ℤ), (45065873370163300000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_GLDPP_fwd_pc
  ⟨[(5392, (-10000000000000000 : ℤ)), (5393, (10000000000000000 : ℤ))], (0 : ℤ), (45065873370163300000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_GLDPP_total_pc
  ⟨[(5393, (-10000000000000000 : ℤ))], (0 : ℤ), (45065873370163300000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_GWDPP_fwd_cplx_HOMODIMER_CNDP2_pc
  ⟨[(3140, (-9552338944849730 : ℤ)), (5395, (10000000000000000 : ℤ))], (0 : ℤ), (45065873370163300000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_GWDPP_fwd_pc
  ⟨[(5395, (-10000000000000000 : ℤ)), (5396, (10000000000000000 : ℤ))], (0 : ℤ), (45065873370163300000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_GWDPP_total_pc
  ⟨[(5396, (-10000000000000000 : ℤ))], (0 : ℤ), (45065873370163300000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_GWDPP_rev_pc
  ⟨[(5397, (-10000000000000000 : ℤ)), (5396, (10000000000000000 : ℤ))], (0 : ℤ), (0 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LADPP_fwd_cplx_HOMODIMER_CNDP2_pc
  ⟨[(3140, (-9552338944849730 : ℤ)), (5398, (10000000000000000 : ℤ))], (0 : ℤ), (45065873370163300000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_LADPP_fwd_pc
  ⟨[(5398, (-10000000000000000 : ℤ)), (5399, (10000000000000000 : ℤ))], (0 : ℤ), (45065873370163300000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_LADPP_total_pc
  ⟨[(5399, (-10000000000000000 : ℤ))], (0 : ℤ), (45065873370163300000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_LADPP_rev_pc
  ⟨[(5400, (-10000000000000000 : ℤ)), (5399, (10000000000000000 : ℤ))], (0 : ℤ), (0 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LGDPP_fwd_cplx_HOMODIMER_CNDP2_pc
  ⟨[(3140, (-9552338944849730 : ℤ)), (5401, (10000000000000000 : ℤ))], (0 : ℤ), (45065873370163300000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_LGDPP_total_pc
  ⟨[(5402, (-10000000000000000 : ℤ))], (0 : ℤ), (45065873370163300000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_LGDPP_rev_pc
  ⟨[(5403, (-10000000000000000 : ℤ)), (5402, (10000000000000000 : ℤ))], (0 : ℤ), (0 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLACPHEHYD_fwd_cplx_HOMODIMER_CNDP2_pc
  ⟨[(3140, (-9552338944849730 : ℤ)), (5404, (10000000000000000 : ℤ))], (0 : ℤ), (45065873370163300000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_LLACPHEHYD_fwd_pc
  ⟨[(5404, (-10000000000000000 : ℤ)), (5405, (10000000000000000 : ℤ))], (0 : ℤ), (45065873370163300000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_LLACPHEHYD_total_pc
  ⟨[(5405, (-10000000000000000 : ℤ))], (0 : ℤ), (45065873370163300000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLACPHEHYD_rev_cplx_HOMODIMER_CNDP2_pc
  ⟨[(3140, (-9552338944849730 : ℤ)), (5406, (10000000000000000 : ℤ))], (0 : ℤ), (45065873370163300000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_LLACPHEHYD_rev_pc
  ⟨[(5406, (-10000000000000000 : ℤ)), (5405, (10000000000000000 : ℤ))], (0 : ℤ), (45065873370163300000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_LLDPP_fwd_cplx_HOMODIMER_CNDP2_pc
  ⟨[(3140, (-9552338944849730 : ℤ)), (5407, (10000000000000000 : ℤ))], (0 : ℤ), (45065873370163300000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_LLDPP_fwd_pc
  ⟨[(5407, (-10000000000000000 : ℤ)), (5408, (10000000000000000 : ℤ))], (0 : ℤ), (45065873370163300000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_LLDPP_rev_pc
  ⟨[(5409, (-10000000000000000 : ℤ)), (5408, (10000000000000000 : ℤ))], (0 : ℤ), (0 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_VLDPP_fwd_cplx_HOMODIMER_CNDP2_pc
  ⟨[(3140, (-9552338944849730 : ℤ)), (5410, (10000000000000000 : ℤ))], (0 : ℤ), (45065873370163300000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_VLDPP_fwd_pc
  ⟨[(5410, (-10000000000000000 : ℤ)), (5411, (10000000000000000 : ℤ))], (0 : ℤ), (45065873370163300000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_VLDPP_total_pc
  ⟨[(5411, (-10000000000000000 : ℤ))], (0 : ℤ), (45065873370163300000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZDL_enzyme_VLDPP_rev_pc
  ⟨[(5412, (-10000000000000000 : ℤ)), (5411, (10000000000000000 : ℤ))], (0 : ℤ), (0 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_2ABUTGLYDP_fwd_cplx_HOMODIMER_CNDP2_pc
  ⟨[(3140, (-9552338944849730 : ℤ)), (5413, (10000000000000000 : ℤ))], (0 : ℤ), (45065873370163300000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩,
  -- R_ENZFM_enzyme_2ABUTGLYDP_fwd_cplx_HOMOHEXAMER_LAP3_pc
  ⟨[(3377, (-22786556632943600 : ℤ)), (5413, (10000000000000000 : ℤ))], (0 : ℤ), (5800893508021250000000 : ℤ), (0 : ℤ), (0 : ℤ)⟩
]
theorem chunk159_cost : (chunk159.map cost).sum = (0 : ℤ) := by
  decide +kernel
def chunks : List (List Column) := [chunk144, chunk145, chunk146, chunk147, chunk148, chunk149, chunk150, chunk151, chunk152, chunk153, chunk154, chunk155, chunk156, chunk157, chunk158, chunk159]
theorem indices_valid : chunks.all (fun rs => rs.all (fun r => r.terms.all (fun p => decide (p.1 < 10411)))) = true := by
  decide +kernel
theorem column_count : (chunks.map List.length).sum = 1024 := by
  decide +kernel
theorem supplies_nonnegative : chunks.all (fun rs => rs.all (fun r => decide (0 ≤ r.supply))) = true := by
  decide +kernel
theorem cost_exact : (chunks.map (fun rs => (rs.map cost).sum)).sum = (0 : ℤ) := by
  norm_num only [chunks, List.map_cons, List.sum_cons, List.map_nil, List.sum_nil, chunk144_cost, chunk145_cost, chunk146_cost, chunk147_cost, chunk148_cost, chunk149_cost, chunk150_cost, chunk151_cost, chunk152_cost, chunk153_cost, chunk154_cost, chunk155_cost, chunk156_cost, chunk157_cost, chunk158_cost, chunk159_cost]
end StoredRedCells.S7Certificate.Part9
